/* サイトを開いた直後専用のセリフ */
const idleMessages = [
  [
    { speaker: "まりん", text: "のんびりやりますか" },
    { speaker: "はじめ", text: "集中、集中……" },
  ],

  [
    { speaker: "まりん", text: "チルい曲でも流す？" },
    { speaker: "はじめ", text: "じゃ、いつもので" },
  ],

  [
    { speaker: "まりん", text: "リラックスしてやろうか" },
    { speaker: "はじめ", text: "だらけちゃダメだからね" },
  ],

  [
    { speaker: "はじめ", text: "タイマーをセットして……" },
    { speaker: "まりん", text: "集中タイム、スタート！" },
  ],

  [
    { speaker: "はじめ", text: "じゃ、始めようか" },
    { speaker: "まりん", text: "はいはーい" },
  ],

  [
    { speaker: "はじめ", text: "また、あくびしてる" },
    { speaker: "まりん", text: "これは深呼吸だから" },
  ],
];

/* 作業時のセリフ一覧 */
const messages = [
  [
    { speaker: "まりん", text: "最近、猫に好かれるんだよね" },
    { speaker: "はじめ", text: "煮干しの匂いでもしてるんじゃない？" },
  ],

  [
    { speaker: "まりん", text: "スマホゲームのスタミナがあふれそう" },
    { speaker: "はじめ", text: "我慢しなさい" },
  ],

  [
    { speaker: "まりん", text: "この大腿骨がエロい……！" },
    { speaker: "はじめ", text: "目の付け所が変態過ぎる" },
  ],

  [
    { speaker: "まりん", text: "そろそろ、ネイル短くしなきゃ" },
    { speaker: "はじめ", text: "ギャルの換毛期だ……" },
  ],

  [
    { speaker: "まりん", text: "素敵な年上と合コンしたい" },
    { speaker: "はじめ", text: "勉強中に欲望丸出しすぎない？" },
  ],

  [
    { speaker: "はじめ", text: "ホント毎日、私の部屋に来るよね" },
    { speaker: "まりん", text: "だって、居心地いいじゃん" },
  ],

  [
    { speaker: "はじめ", text: "なにスマホで読んでるの？" },
    { speaker: "まりん", text: "ネイチャーとサイエンス" },
  ],

  [
    { speaker: "はじめ", text: "宿題、先に済ませないと……" },
    { speaker: "まりん", text: "やばっ……存在を忘れてた" },
  ],

  [
    { speaker: "はじめ", text: "おしゃべりしないで、勉強勉強……" },
    { speaker: "まりん", text: "えー、もっと気軽に話そうよ" },
  ],

  [
    { speaker: "はじめ", text: "軽くストレッチしようかな" },
    { speaker: "まりん", text: "私も肩がバキバキだわ" },
  ],
];

/* 休憩中専用のセリフ一覧 */
const breakMessages = [
  {
    keyword: "ドーナッツ",
    dialogue: [
      { speaker: "まりん", text: "また【ドーナッツ】食べてる" },
      { speaker: "はじめ", text: "糖分は必要だから。仕方ないから" },
    ],
  },

  {
    keyword: "学級委員長",
    dialogue: [
      { speaker: "はじめ", text: "明日、委員会あるんだった" },
      { speaker: "まりん", text: "【学級委員長】も大変だね" },
    ],
  },

  {
    keyword: "コーヒー",
    dialogue: [
      { speaker: "まりん", text: "ホントに好きだよね、【コーヒー】" },
      { speaker: "はじめ", text: "この苦みが私を高めてくれる……" },
    ],
  },

  {
    keyword: "誕生日プレゼント",
    dialogue: [
      { speaker: "まりん", text: "はじめ、それ１個ちょうだい" },
      { speaker: "はじめ", text: "今年の【誕生日プレゼント】これね" },
    ],
  },

  {
    keyword: "眼鏡",
    dialogue: [
      { speaker: "はじめ", text: "【眼鏡】にゴミが……" },
      { speaker: "まりん", text: "コンタクトにしないの？" },
    ],
  },

  {
    keyword: "北斗の拳",
    dialogue: [
      { speaker: "はじめ", text: "スマホで読んでるの、漫画？" },
      { speaker: "まりん", text: "【北斗の拳】。ゆーあーしょっく" },
    ],
  },

  {
    keyword: "ラムネ",
    dialogue: [
      { speaker: "はじめ", text: "糖分が足りなくなってきた……" },
      { speaker: "まりん", text: "【ラムネ】食べる？" },
    ],
  },

  {
    keyword: "幼なじみ",
    dialogue: [
      { speaker: "はじめ", text: "まりん、ちょっと静かにして" },
      { speaker: "まりん", text: "【幼なじみ】に冷たくない……？" },
    ],
  },

  {
    keyword: "ママ",
    dialogue: [
      { speaker: "まりん", text: "あ、【ママ】からLINEだ……" },
      { speaker: "はじめ", text: "へー、なんかあったの？" },
    ],
  },

  {
    keyword: "スリランカの首都",
    dialogue: [
      { speaker: "はじめ", text: "【スリランカの首都】ってなんだっけ" },
      { speaker: "まりん", text: "待って、今スマホで調べる" },
    ],
  },

  {
    keyword: "論文",
    dialogue: [
      { speaker: "まりん", text: "あ！　新しい【論文】出てるじゃん！" },
      { speaker: "はじめ", text: "なにそのコンビニの新商品的なノリ" },
    ],
  },

  {
    keyword: "進路",
    dialogue: [
      { speaker: "まりん", text: "【進路】の調査票、書くの忘れてた" },
      { speaker: "はじめ", text: "今書いちゃいなよ、今……" },
    ],
  },

  {
    keyword: "三葉虫",
    dialogue: [
      { speaker: "まりん", text: "【三葉虫】、飼いたくない？" },
      { speaker: "はじめ", text: "いや、キモいって……" },
    ],
  },

  {
    keyword: "彼氏",
    dialogue: [
      { speaker: "まりん", text: "２組の高木さん、【彼氏】できたって" },
      { speaker: "はじめ", text: "え、全然興味ない……" },
    ],
  },

  {
    keyword: "バイト",
    dialogue: [
      { speaker: "まりん", text: "いっしょに【バイト】しない？" },
      { speaker: "はじめ", text: "え、急にどうしたの？" },
    ],
  },

  {
    keyword: "部活",
    dialogue: [
      { speaker: "まりん", text: "はじめって【部活】は興味あるの？" },
      { speaker: "はじめ", text: "気になってたのはあったかな" },
    ],
  },
];

/* 作業再開した時専用のセリフ一覧 */
const resumeMessages = [
  [
    { speaker: "まりん", text: "じゃ、再開しようか" },
    { speaker: "はじめ", text: "うん、やろう" },
  ],

  [
    { speaker: "まりん", text: "おっ、やる気あるね" },
    { speaker: "はじめ", text: "ちゃんと休憩できた" },
  ],

  [
    { speaker: "まりん", text: "もうひと頑張りしますかね" },
    { speaker: "はじめ", text: "集中、集中……" },
  ],

  [
    { speaker: "はじめ", text: "はい、休憩終了" },
    { speaker: "まりん", text: "う～ん、リフレッシュ" },
  ],

  [
    { speaker: "はじめ", text: "まりん、再開するよ" },
    { speaker: "まりん", text: "ほいほ～い！" },
  ],

  [
    { speaker: "はじめ", text: "タイマーかけるね" },
    { speaker: "まりん", text: "保ってよ、私の集中力！" },
  ],
];

/* キーワードの別名リスト
   入力欄にこれらの語が入ると、対応する本来のキーワードに変換される */
const keywordMap = {
  コーヒー: ["コーヒー", "こーひー", "珈琲"],
  勉強: ["勉強", "べんきょう"],
  高校受験: ["高校受験", "こうこうじゅけん"],
  全国模試: ["全国模試", "ぜんこくもし", "模試", "もし"],
  色々: ["色々", "いろいろ"],

  獣医: [
    "獣医",
    "じゅうい",
    "獣医師",
    "じゅういし",
    "獣医学",
    "じゅういがく",
    "獣医学部",
    "じゅういがくぶ",
  ],

  古生物学者: [
    "古生物学者",
    "こせいぶつがくしゃ",
    "古生物学",
    "こせいぶつがく",
    "古生物学部",
    "こせいぶつがくぶ",
  ],

  小柴教授: ["小柴教授", "こしばきょうじゅ", "小柴", "こしば"],
  化石: ["化石", "かせき"],

  ハーバード大学: [
    "ハーバード大学",
    "はーばーどだいがく",
    "ハーバード",
    "はーばーど",
  ],

  誕生日プレゼント: [
    "誕生日プレゼント",
    "たんじょうびぷれぜんと",
    "バースデープレゼント",
    "ばーすでーぷれぜんと",
    "誕プレ",
    "たんぷれ",
  ],

  "１２月２４日": [
    "クリスマスイブ",
    "くりすますいぶ",
    "１２月２４日",
    "12月24日",
    "１２／２４",
    "12/24",
    "十二月二十四日",
  ],

  ファーストキス: ["ファーストキス", "ふぁーすときす", "キス", "きす"],

  唇にキスをした: [
    "唇にキスをした",
    "くちびるにキスをした",
    "唇にきすをした",
    "くちびるにきすをした",

    "唇にキス",
    "くちびるにキス",
    "唇にきす",
    "くちびるにきす",

    "唇にちゅーをした",
    "くちびるにちゅーをした",

    "唇にちゅー",
    "くちびるにちゅー",

    "口にキスをした",
    "くちにキスをした",
    "口にきすをした",
    "くちにきすをした",

    "口にキス",
    "くちにキス",
    "口にきす",
    "くちにきす",

    "口にちゅーをした",
    "くちにちゅーをした",

    "口にちゅー",
    "くちにちゅー",

    "唇にキスした",
    "くちびるにキスした",
    "唇にきすした",
    "くちびるにきすした",

    "唇にちゅーした",
    "くちびるにちゅーした",

    "口にキスした",
    "くちにキスした",
    "口にきすした",
    "くちにきすした",

    "口にちゅーした",
    "くちにちゅーした",
  ],

  女同士: ["女同士", "おんなどうし"],

  さくらんぼ餅: [
    "さくらんぼ餅",
    "さくらんぼもち",
    "サクランボ餅",
    "サクランボもち",
  ],

  駄菓子屋さん: ["駄菓子屋さん", "だがしやさん", "駄菓子屋", "だがしや"],
  鳥類: ["鳥類", "ちょうるい"],

  ねじまき鳥商店: [
    "ねじまき鳥商店",
    "ネジまきどり商店",
    "ねじまきどり商店",
    "ねじまきどりしょうてん",
    "ねじまき鳥",
    "ネジまきどり",
    "ねじまきどり",
  ],

  まりん: ["まりん"],
  はじめ: ["はじめ"],
  一: ["一"],
  万里杏音: ["万里杏音", "まりあんぬ"],
  献花: ["献花", "けんか"],
  竜胆: ["竜胆", "りんどう", "竜胆一", "りんどうはじめ"],
  織田: ["織田", "おだ", "織田信長", "おだのぶなが", "信長", "のぶなが"],

  織田万里杏音: [
    "織田万里杏音",
    "おだまりあんぬ",
    "織田まりあんぬ",
    "おだ万里杏音",
  ],

  エロい話: ["エロい話", "えろい話", "エロいはなし", "えろいはなし"],
  めちゃくちゃのぐちゃぐちゃ: ["めちゃくちゃのぐちゃぐちゃ"],
  北斗の拳: ["北斗の拳", "北斗のけん", "ほくとの拳", "ほくとのけん"],

  お前はもう死んでいる: [
    "お前はもう死んでいる",
    "お前はもうしんでいる",
    "おまえはもう死んでいる",
    "おまえはもうしんでいる",
    "まりんはもう死んでいる",
    "まりんはもうしんでいる",
    "織田万里杏音はもう死んでいる",
    "織田万里杏音はもうしんでいる",
    "おだまりあんぬはもう死んでいる",
    "おだまりあんぬはもうしんでいる",
    "万里杏音はもう死んでいる",
    "万里杏音はもうしんでいる",
    "まりあんぬはもう死んでいる",
    "まりあんぬはもうしんでいる",
  ],

  また会う日まで: [
    "また会う日まで",
    "また会うひまで",
    "またあう日まで",
    "またあうひまで",
    "また逢う日まで",
    "また逢うひまで",
    "またあうひまで",
  ],

  お別れは笑顔で: [
    "お別れは笑顔で",
    "おわかれは笑顔で",
    "お別れはえがおで",
    "おわかれはえがおで",
  ],

  始まりの物語: [
    "始まりの物語",
    "始まりのものがたり",
    "はじまりの物語",
    "はじまりのものがたり",
  ],

  幼なじみ: ["幼なじみ", "おさななじみ"],
  ドーナッツ: ["ドーナッツ", "どーなっつ", "ドーナツ", "どーなつ"],

  学級委員長: [
    "学級委員長",
    "がっきゅういいんちょう",
    "委員長",
    "いいんちょう",
  ],

  ママ: [
    "ママ",
    "まま",
    "親",
    "おや",
    "両親",
    "りょうしん",
    "母",
    "はは",
    "母親",
    "ははおや",
  ],

  眼鏡: ["眼鏡", "めがね"],

  スリジャヤワルダナプラコッテ: [
    "スリジャヤワルダナプラコッテ",
    "すりじゃやわるだなぷらこって",
    "スリ・ジャヤワルダナプラ・コッテ",
    "すり・じゃやわるだなぷら・こって",
  ],

  ラムネ: ["ラムネ", "らむね", "ラムネ菓子", "ラムネがし", "らむね菓子"],
  パパ: ["パパ", "ぱぱ", "父", "ちち", "父親", "ちちおや"],
  進路: ["進路", "しんろ", "進学", "しんがく", "大学", "だいがく"],
  三葉虫: ["三葉虫", "さんようちゅう"],
  論文: ["論文", "ろんぶん"],
  彼氏: ["彼氏", "かれし", "恋人", "こいびと", "恋愛", "れんあい"],
  バイト: ["バイト", "ばいと", "アルバイト", "あるばいと"],

  部活: [
    "部活",
    "ぶかつ",
    "部活動",
    "ぶかつどう",
    "同好会",
    "どうこうかい",
    "クラブ活動",
    "くらぶかつどう",
  ],

  茶道部: ["茶道部", "さどうぶ", "茶道", "さどう"],
};

const quizData = {
  スリランカの首都: {
    answer: "スリジャヤワルダナプラコッテ",
    hint: "ネット検索などを駆使して答えましょう",
  },

  はじめの入りたかった部活: {
    answer: "茶道部",
    hint: "はじめの入りたかった部活動を答えましょう",
  },

  はじめの夢: {
    answer: "獣医",
    hint: "はじめの将来の夢を答えましょう",
  },

  まりんの夢: {
    answer: "古生物学者",
    hint: "まりんの将来の夢を答えましょう",
  },

  古生物学の最高学府: {
    answer: "ハーバード大学",
    hint: "まりんの狙っている大学を答えましょう",
  },

  私の誕生日の前日: {
    answer: "１２月２４日",
    hint: "はじめの誕生日の前日を答えましょう",
  },

  どこになにをした: {
    answer: "唇にキスをした",
    hint: "まりんが『どこになにをした』ことで\n喧嘩になったか答えましょう",
  },

  ナントカ商店: {
    answer: "ねじまき鳥商店",
    hint: "駄菓子屋の正式な店名を答えましょう",
  },

  誰: {
    answer: "織田万里杏音",
    hint: "交通事故で亡くなった人を\nフルネームで答えましょう",
  },

  はじめの名前: {
    answer: "一",
    hint: "はじめの名前を答えましょう",
  },

  私の名前: {
    answer: "万里杏音",
    hint: "まりんの名前を答えましょう",
  },

  はじめの名字の花: {
    answer: "竜胆",
    hint: "はじめの名字にあたる花の名前を答えましょう",
  },

  私の名字: {
    answer: "織田",
    hint: "まりんの名字を答えましょう",
  },

  私の好きな漫画っぽく言ってよ: {
    answer: "お前はもう死んでいる",
    hint: "まりんの好きな漫画のセリフで事実を伝えましょう",
  },
};

/* キーワード対応セリフ一覧 */
const keywordDialogues = {
  コーヒー: {
    dialogue: [
      [
        { speaker: "はじめ", text: "まりんはコーヒー大好きだよねえ" },
        { speaker: "まりん", text: "この苦みが私を高めてくれる……" },
      ],
      [
        { speaker: "まりん", text: "どう？　横顔が知的に見える？" },
        { speaker: "はじめ", text: "その発言はバカっぽいなぁ……" },
      ],
      [
        { speaker: "まりん", text: "はじめはコーヒー苦手だもんね？" },
        { speaker: "はじめ", text: "さ、砂糖入れたらいけるし……" },
      ],
      [
        { speaker: "まりん", text: "えー、ホントにぃ……？" },
        { speaker: "はじめ", text: "私も高校生なんで、流石にね" },
      ],
      [
        { speaker: "まりん", text: "じゃあ、私のひとくち飲む？" },
        { speaker: "はじめ", text: "…………（苦々しい顔）" },
      ],
    ],
  },

  勉強: {
    dialogue: [
      [
        { speaker: "まりん", text: "最近、勉強に力が入ってるよね" },
        { speaker: "はじめ", text: "うーん……まあね" },
      ],
      [
        { speaker: "まりん", text: "こんなの【高校受験】以来じゃない？" },
        { speaker: "はじめ", text: "あのときは頑張ったな……" },
      ],
      [
        { speaker: "まりん", text: "期末試験は全然先だし……" },
        { speaker: "まりん", text: "もしかして、週末の【全国模試】？" },
      ],
    ],
  },

  高校受験: {
    dialogue: [
      [
        { speaker: "まりん", text: "高校受験も懐かしいね" },
        { speaker: "はじめ", text: "私は思い出したくない" },
      ],
      [
        { speaker: "まりん", text: "私と同じ高校入るのに頑張ったもんね" },
        { speaker: "はじめ", text: "う、うるさいなぁ……" },
      ],
      [
        { speaker: "はじめ", text: "まりんの偏差値が高すぎるせいで……" },
        { speaker: "はじめ", text: "ホントあの時、苦労したんだから" },
      ],
      [
        { speaker: "まりん", text: "そんなに私といっしょがよかった？" },
        { speaker: "はじめ", text: "まりん、すぐ遠くに行っちゃうし……" },
      ],
      [
        { speaker: "まりん", text: "ずっとそばに居てほしいってこと？" },
        { speaker: "はじめ", text: "あー、もう。勉強に戻るよ！" },
      ],
    ],
  },

  全国模試: {
    dialogue: [
      [
        { speaker: "まりん", text: "最近、勉強に力を入れてるのは" },
        { speaker: "まりん", text: "週末の全国模試に備えてたんだ？" },
      ],
      [
        { speaker: "はじめ", text: "ま、そういうこと" },
        { speaker: "まりん", text: "はじめが模試に気合い入れるなんて" },
      ],
      [
        { speaker: "はじめ", text: "うちらだって、もう高２だよ" },
        { speaker: "はじめ", text: "そろそろ将来を考える時期でしょ" },
      ],
      [
        { speaker: "まりん", text: "はじめ、立派になったな" },
        { speaker: "はじめ", text: "誰視点のコメント？" },
      ],
      [
        { speaker: "まりん", text: "いい大学を狙うことしたと？" },
        { speaker: "はじめ", text: "まあね" },
      ],
      [
        { speaker: "まりん", text: "高校受験で力尽きたって話だったのに" },
        { speaker: "まりん", text: "それって、どういう心境の変化？" },
      ],
      [
        { speaker: "はじめ", text: "【色々】あって、私にも夢できたから" },
        { speaker: "まりん", text: "【はじめの夢】？　教えて教えて！" },
      ],
    ],
  },

  色々: {
    dialogue: [
      [
        { speaker: "まりん", text: "色々あったって気になるなー" },
        { speaker: "はじめ", text: "色々は色々だから……" },
      ],
      [
        { speaker: "まりん", text: "まあまあ、教えてよ" },
        { speaker: "まりん", text: "私とはじめちゃんの仲じゃん？" },
      ],
      [
        { speaker: "はじめ", text: "……………………" },
        { speaker: "はじめ", text: "ケガした動物を引き取ったの" },
      ],
      [
        { speaker: "はじめ", text: "何度も診てもらってるうちに" },
        { speaker: "はじめ", text: "自分でも治してあげられたらって……" },
      ],
      [
        { speaker: "まりん", text: "やさしーっ！　控えめに言って神！" },
        { speaker: "はじめ", text: "どこどこ？　見たい見たい！" },
      ],
      [
        { speaker: "はじめ", text: "…………そのうちにね" },
        { speaker: "まりん", text: "っしゃー！　吸いまくるぞー！" },
      ],
      [
        { speaker: "まりん", text: "あ……。私、アレルギーあるんだった" },
        { speaker: "はじめ", text: "すぐに見せなくて正解" },
      ],
    ],
  },

  獣医: {
    dialogue: [
      [
        { speaker: "まりん", text: "つまり動物病院に通ううちに" },
        { speaker: "まりん", text: "獣医さんを目指したくなってきたと" },
      ],
      [
        { speaker: "はじめ", text: "そういうこと" },
        { speaker: "まりん", text: "なんて立派な動機……！" },
      ],
      [
        { speaker: "まりん", text: "はじめの夢、応援する！" },
        { speaker: "はじめ", text: "でもヤバいよ、獣医学部は……" },
      ],
      [
        { speaker: "まりん", text: "まあ、医学部よりは簡単なはずだから" },
        { speaker: "はじめ", text: "私にとっては大差ないの！" },
      ],
      [
        { speaker: "はじめ", text: "まったく、天才キャラはこれだから……" },
        { speaker: "まりん", text: "いやいや、私なんてまだまだ……" },
      ],
      [
        { speaker: "はじめ", text: "まあ、【まりんの夢】に比べたら" },
        { speaker: "はじめ", text: "現実的な夢ではあるけどね" },
      ],
      [
        { speaker: "はじめ", text: "えーと、何学の学者さんだっけ……" },
        { speaker: "はじめ", text: "……こ、考古学？" },
      ],
      [
        { speaker: "まりん", text: "惜しい！" },
        { speaker: "まりん", text: "それはインディ・ジョーンズね" },
      ],
    ],
  },

  古生物学者: {
    dialogue: [
      [
        { speaker: "はじめ", text: "古い時代の生物を研究するから" },
        { speaker: "はじめ", text: "古生物学者で合ってるよね？" },
      ],
      [
        { speaker: "まりん", text: "正解！　はじめ、やるぅ！" },
        { speaker: "はじめ", text: "何年、友達やってると思ってんの" },
      ],
      [
        { speaker: "はじめ", text: "【化石】を掘りに留学するんだよね？" },
        { speaker: "まりん", text: "ザッツライト" },
      ],
      [
        { speaker: "はじめ", text: "去年の夏休みなんて、びっくりだよ" },
        { speaker: "はじめ", text: "カナダから帰ってこないんだもん" },
      ],
      [
        { speaker: "まりん", text: "【小柴教授】が誘ってくれて" },
        { speaker: "まりん", text: "発掘調査を見学させてくたからさー" },
      ],
      [
        { speaker: "はじめ", text: "でも、急に海外なんて……" },
        { speaker: "まりん", text: "貴重な機会だもん、逃せないよ" },
      ],
      [
        { speaker: "まりん", text: "私の狙いは【古生物学の最高学府】" },
        { speaker: "まりん", text: "そのために今から経験積まないとね" },
      ],
    ],
  },

  化石: {
    dialogue: [
      [
        { speaker: "まりん", text: "化石……カセキホリタイ……" },
        { speaker: "はじめ", text: "ヤバい、禁断症状が……" },
      ],
      [
        { speaker: "はじめ", text: "まあ、まりんがハマるのもわかるよ" },
        { speaker: "はじめ", text: "あんなすごいもの見つけたら" },
      ],
      [
        { speaker: "はじめ", text: "まあ、まりんがハマるのもわかるよ" },
        { speaker: "はじめ", text: "あんなすごいもの見つけたら" },
      ],
      [
        { speaker: "まりん", text: "小３の野外学習ではぐれたときね" },
        { speaker: "まりん", text: "まさか恐竜の頭蓋骨を見つけるとは" },
      ],
      [
        { speaker: "まりん", text: "元から昔の生き物は好きだったけど" },
        { speaker: "まりん", text: "あれで化石のトリコになっちゃったな" },
      ],
      [
        { speaker: "まりん", text: "教授に出会ったのも、あのときだしね" },
        { speaker: "はじめ", text: "また教授……" },
      ],
      [
        { speaker: "まりん", text: "あぁ、化石……" },
        { speaker: "まりん", text: "どうして、そんなに美しいの？" },
      ],
      [
        { speaker: "まりん", text: "時を超えたロマン、ラララ～♪" },
        { speaker: "はじめ", text: "ミュージカル始まっちゃったよ" },
      ],
    ],
  },

  小柴教授: {
    dialogue: [
      [
        { speaker: "はじめ", text: "えーと、小柴教授だよね？" },
        { speaker: "はじめ", text: "まりんを気に入ってる古生物博士って" },
      ],
      [
        { speaker: "まりん", text: "フィールドワークに誘ってくれるし" },
        { speaker: "まりん", text: "私のへたっぴな論文も読んでくれるし" },
      ],
      [
        { speaker: "まりん", text: "何より大人の雰囲気がたまらない" },
        { speaker: "はじめ", text: "ホント、年上好きだよね" },
      ],
      [
        { speaker: "まりん", text: "シルバーの素敵な御髪……" },
        { speaker: "まりん", text: "パイプを吸っているときの後ろ姿" },
      ],
      [
        { speaker: "まりん", text: "ハンマーを振るう、引き締まった腕" },
        { speaker: "まりん", text: "思い出すだけで、ため息が出ちゃうな" },
      ],
      [
        { speaker: "まりん", text: "そんな教授と夜のテントでは二人きり" },
        { speaker: "はじめ", text: "え゛っ！？" },
      ],
      [
        { speaker: "はじめ", text: "だ、ダメ！　ダメでしょ、そんなの！" },
        { speaker: "まりん", text: "え、なんで？　別によくない？" },
      ],
      [
        { speaker: "まりん", text: "寒い夜。寝袋で肌と肌を寄せ合い……" },
        { speaker: "はじめ", text: "ぬぐぐ……" },
      ],
    ],
  },

  ハーバード大学: {
    dialogue: [
      [
        { speaker: "はじめ", text: "古生物学の最高学府というと" },
        { speaker: "はじめ", text: "つまりはハーバード大学……" },
      ],
      [
        { speaker: "まりん", text: "ハバ大、いいよね……" },
        { speaker: "はじめ", text: "そんな略し方、初めて聞いた" },
      ],
      [
        { speaker: "まりん", text: "単に受験するだけじゃなくて" },
        { speaker: "まりん", text: "実績とか推薦とか色々必要でさー" },
      ],
      [
        { speaker: "まりん", text: "小柴教授のご厚意に甘えまくって" },
        { speaker: "まりん", text: "コネでもなんでも利用しなくちゃね" },
      ],
      [
        { speaker: "はじめ", text: "………………" },
        { speaker: "まりん", text: "どうしたの？　急に悲しげな顔して" },
      ],
      [
        { speaker: "まりん", text: "わかった。さびしいんだ" },
        { speaker: "まりん", text: "私と離ればなれになっちゃうから" },
      ],
      [
        { speaker: "はじめ", text: "ち、違うって……！" },
        { speaker: "まりん", text: "私の前では強がらなくていいよ" },
      ],
      [
        { speaker: "はじめ", text: "いや、その……" },
        { speaker: "はじめ", text: "まりん、大事なこと忘れてない？" },
      ],
      [
        { speaker: "まりん", text: "大事なこと……？" },
        { speaker: "はじめ", text: "私たち、喧嘩してたんだよ" },
      ],
      [
        { speaker: "はじめ", text: "喧嘩の原因も、覚えてないでしょ？" },
        { speaker: "はじめ", text: "まりんが【どこになにをした】か……" },
      ],
      [
        { speaker: "まりん", text: "私たち、喧嘩してたの？" },
        { speaker: "はじめ", text: "やっぱり完全に忘れてる" },
      ],
      [
        { speaker: "まりん", text: "え、待って。それ、いつの話？" },
        { speaker: "はじめ", text: "【私の誕生日の前日】" },
      ],
      [
        { speaker: "はじめ", text: "別に思い出さなくていいからね" },
        { speaker: "まりん", text: "そう言われると逆に気になる" },
      ],
    ],
  },

  誕生日プレゼント: {
    dialogue: [
      [
        { speaker: "まりん", text: "そのドーナッツ、ひとつほしいな" },
        { speaker: "はじめ", text: "今年の誕プレ、これでいい？" },
      ],
      [
        { speaker: "まりん", text: "誕プレでドーナッツ１個はヤバい" },
        { speaker: "はじめ", text: "私のドーナッツは高く付くからね" },
      ],
      [
        { speaker: "まりん", text: "あー、今年の誕プレなんだろう？" },
        { speaker: "まりん", text: "図鑑かな？　ロックハンマーかな？" },
      ],
      [
        { speaker: "はじめ", text: "みんな、わくわくできていいよね" },
        { speaker: "はじめ", text: "私なんか『まとめて』だもん" },
      ],
      [
        { speaker: "まりん", text: "はじめの場合はそうなっちゃうか……" },
        { speaker: "はじめ", text: "せめて、当日じゃなかったらなー" },
      ],
      [
        { speaker: "まりん", text: "私が２倍祝うから元気出して♥" },
        { speaker: "はじめ", text: "………………（ジト目）" },
      ],
    ],
  },

  "１２月２４日": {
    dialogue: [
      [
        { speaker: "まりん", text: "はじめの誕生日がクリスマスだから" },
        { speaker: "まりん", text: "その前日はクリスマスイブ……あっ！" },
      ],
      [
        { speaker: "まりん", text: "私がイギリスに出発した日じゃん！" },
        { speaker: "はじめ", text: "しかも、当日になって私に言ったよね" },
      ],
      [
        { speaker: "まりん", text: "ロンドンの自然史博物館を" },
        { speaker: "まりん", text: "教授が案内してくれるっていうから" },
      ],
      [
        { speaker: "はじめ", text: "だからって、その日の便に乗る！？" },
        { speaker: "はじめ", text: "いや、まあ、それはよくて……" },
      ],
      [
        { speaker: "はじめ", text: "まりんが出発前にうちに寄って" },
        { speaker: "はじめ", text: "私にしたことが問題だから！" },
      ],
      [
        { speaker: "まりん", text: "【どこになにをした】かでしょ……？" },
        { speaker: "まりん", text: "うーん、ヒント！　ヒントお願い！" },
      ],
      [
        { speaker: "はじめ", text: "ひ、ヒント……？　まあ……" },
        { speaker: "はじめ", text: "『初めて』じゃなかったかな……" },
      ],
      [
        { speaker: "まりん", text: "あごにアッパーをした？" },
        { speaker: "はじめ", text: "１回でもするな、そんなこと！" },
      ],
    ],
  },

  幼なじみ: {
    dialogue: [
      [
        { speaker: "はじめ", text: "私たちは幼なじみというより……" },
        { speaker: "はじめ", text: "腐れ縁の関係って方が近くない？" },
      ],
      [
        { speaker: "まりん", text: "いやいや、何をおっしゃいますやら" },
        { speaker: "まりん", text: "私たち幼稚園からいっしょじゃん！" },
      ],
      [
        { speaker: "まりん", text: "ちゅーの練習もした仲でしょ！？" },
        { speaker: "はじめ", text: "……ちょっ！？" },
      ],
      [
        { speaker: "はじめ", text: "そんなの５歳くらいの話じゃん！" },
        { speaker: "はじめ", text: "なんで、それは覚えてるの！？" },
      ],
      [
        { speaker: "まりん", text: "そりゃ【ファーストキス】ですから" },
        { speaker: "はじめ", text: "忘れて！　早く忘れて！" },
      ],
      [
        { speaker: "まりん", text: "いーや、死ぬまで忘れないね" },
        { speaker: "まりん", text: "老人ホームでも話すね" },
      ],
    ],
  },

  ファーストキス: {
    dialogue: [
      [
        { speaker: "はじめ", text: "ちゅーの練習のことなんて忘れてよ" },
        { speaker: "まりん", text: "ファーストキスだから忘れませーん！" },
      ],
      [
        { speaker: "はじめ", text: "でも、ファーストキスとか言ってさ" },
        { speaker: "はじめ", text: "まりん、よくキスしてるじゃん" },
      ],
      [
        { speaker: "まりん", text: "アレは挨拶だよ、挨拶" },
        { speaker: "まりん", text: "おはよー、ちゅっ♥　みたいな" },
      ],
      [
        { speaker: "はじめ", text: "あれで何人の後輩を惑わしてきたか" },
        { speaker: "まりん", text: "すまんな。モテてすまんな" },
      ],
      [
        { speaker: "まりん", text: "でも、私にもルールはあるからね" },
        { speaker: "まりん", text: "基本、ほっぺにしかしないし……" },
      ],
      [
        { speaker: "はじめ", text: "じゃあ、唇にする場合は本気なんだ" },
        { speaker: "まりん", text: "そういうことになりますかね……" },
      ],
      [
        { speaker: "はじめ", text: "言質取ったからね" },
        { speaker: "まりん", text: "…………？" },
      ],
    ],
  },

  唇にキスをした: {
    dialogue: [
      [
        { speaker: "まりん", text: "はじめと喧嘩した原因……" },
        { speaker: "まりん", text: "………………………………あっ" },
      ],
      [
        { speaker: "はじめ", text: "ようやく思い出したんだ？" },
        { speaker: "まりん", text: "え、でも、そんなことで……" },
      ],

      [
        { speaker: "はじめ", text: "まりんがイギリスに出発する朝" },
        { speaker: "はじめ", text: "私の唇にキスしたよね……！？" },
      ],
      [
        { speaker: "はじめ", text: "１日早い誕生日プレゼントとか言って" },
        { speaker: "はじめ", text: "あれ、なんだったわけ？？？" },
      ],
      [
        { speaker: "まりん", text: "誕生日すっぽかすのも悪いから" },
        { speaker: "まりん", text: "ちょっと誠意を見せようと思って……" },
      ],
      [
        { speaker: "はじめ", text: "年明けても帰国してこないし……" },
        { speaker: "はじめ", text: "待たされた側の気持ちにもなってよ！" },
      ],
      [
        { speaker: "まりん", text: "そ、そんなに気にしてたの……？" },
        { speaker: "はじめ", text: "こっちの気も知らないで……" },
      ],
      [
        { speaker: "はじめ", text: "まりんは教授が好きなんでしょ？" },
        { speaker: "はじめ", text: "キスだってしてるんでしょ？" },
      ],
      [
        { speaker: "まりん", text: "たまにしてるけど、問題なくない？" },
        { speaker: "まりん", text: "私も教授も【女同士】なんだし……" },
      ],
    ],
  },

  女同士: {
    dialogue: [
      [
        { speaker: "まりん", text: "はじめ、なんか勘違いしてない？" },
        { speaker: "まりん", text: "小柴教授は女の人だよ？" },
      ],
      [
        { speaker: "はじめ", text: "わかってるよ。会ったことあるし" },
        { speaker: "まりん", text: "仕事のできる大人の女だったでしょ？" },
      ],
      [
        { speaker: "まりん", text: "私、真面目に小柴教授を尊敬してて" },
        { speaker: "まりん", text: "会うたびに嬉しくなっちゃうから……" },
      ],
      [
        { speaker: "まりん", text: "挨拶代わりに、ほっぺにちゅっと……" },
        { speaker: "はじめ", text: "それ！　それが大問題！" },
      ],
      [
        { speaker: "まりん", text: "いや、だから女同士……" },
        { speaker: "まりん", text: "……………………………" },
      ],
      [
        { speaker: "まりん", text: "あっ…………" },
        { speaker: "はじめ", text: "………………" },
      ],
      [
        { speaker: "まりん", text: "…………ごめん" },
        { speaker: "はじめ", text: "いいよ、あのあと仲直りしたから" },
      ],
      [
        { speaker: "まりん", text: "そんな大切なことなのに……" },
        { speaker: "まりん", text: "なんで忘れちゃってたんだろう？" },
      ],
      [
        { speaker: "まりん", text: "とりあえず、はじめには……" },
        { speaker: "まりん", text: "お詫びの【さくらんぼ餅】をどうぞ" },
      ],
    ],
  },

  さくらんぼ餅: {
    dialogue: [
      [
        { speaker: "はじめ", text: "それ……！？" },
        { speaker: "まりん", text: "え、どしたの？" },
      ],
      [
        { speaker: "まりん", text: "普通のさくらんぼ餅でしょ？" },
        { speaker: "まりん", text: "食べて食べて。はじめ用に買ったから" },
      ],
      [
        { speaker: "まりん", text: "ん……？　そういえば……" },
        { speaker: "はじめ", text: "遠足のおやつによく買ったよね" },
      ],
      [
        { speaker: "はじめ", text: "あ……うん。小学生のときとか" },
        { speaker: "まりん", text: "そうそう。えーと……" },
      ],
      [
        { speaker: "まりん", text: "あの駄菓子屋さんで……" },
        { speaker: "まりん", text: "…………ん？" },
      ],
      [
        { speaker: "まりん", text: "駄菓子屋さんの名前も忘れちゃった" },
        { speaker: "まりん", text: "【ナントカ商店】……だよね？" },
      ],
      [
        { speaker: "はじめ", text: "ムリに思い出さなくてもよくない？" },
        { speaker: "まりん", text: "いや、はじめが教えてよ" },
      ],
      [
        { speaker: "はじめ", text: "まりんが苦しんでるの、ここで見てる" },
        { speaker: "まりん", text: "鬼畜眼鏡！　糖分中毒！" },
      ],
      [
        { speaker: "まりん", text: "たぶん【鳥類】なんだけどな" },
        { speaker: "はじめ", text: "範囲、広くない？" },
      ],
      [
        { speaker: "まりん", text: "うーん、なんでだろう……" },
        { speaker: "まりん", text: "思い出さなくちゃいけない気がする" },
      ],
    ],
  },

  鳥類: {
    dialogue: [
      [
        { speaker: "まりん", text: "ナントカ商店だったよね" },
        { speaker: "まりん", text: "二人で通ってた駄菓子屋さん" },
      ],
      [
        { speaker: "まりん", text: "ナントカの部分は鳥類で……" },
        { speaker: "はじめ", text: "うんうん" },
      ],
      [
        { speaker: "まりん", text: "ドラクエに出てきて……" },
        { speaker: "はじめ", text: "はいはい" },
      ],
      [
        { speaker: "まりん", text: "村上春樹の小説にも出てた……" },
        { speaker: "はじめ", text: "ほうほう" },
      ],
      [
        { speaker: "はじめ", text: "それで逆によく思い出せないね" },
        { speaker: "まりん", text: "喉元まで出かかってるのにー！" },
      ],
    ],
  },

  ねじまき鳥商店: {
    dialogue: [
      [
        { speaker: "まりん", text: "……思い出した！" },
        { speaker: "まりん", text: "ねじまき鳥商店だよっ！" },
      ],
      [
        { speaker: "まりん", text: "あー、思い出せてよかった" },
        { speaker: "はじめ", text: "……………………" },
      ],
      [
        { speaker: "まりん", text: "それで……そうそう……" },
        { speaker: "まりん", text: "お店の角に【献花】があってさ" },
      ],
      [
        { speaker: "まりん", text: "献花……？" },
        { speaker: "まりん", text: "……………" },
      ],
      [
        { speaker: "まりん", text: "交通事故……なのかな？" },
        { speaker: "はじめ", text: "まりん、それは……" },
      ],
      [
        { speaker: "まりん", text: "【誰】が亡くなっちゃったんだろ……" },
        { speaker: "はじめ", text: "……………………" },
      ],
      [
        { speaker: "まりん", text: "はじめ、何か知ってるの？" },
        { speaker: "はじめ", text: "知らない……" },
      ],
      [
        { speaker: "まりん", text: "……………………" },
        { speaker: "はじめ", text: "……………………" },
      ],
      [
        { speaker: "まりん", text: "お願い、【はじめ】" },
        { speaker: "はじめ", text: "【まりん】……" },
      ],
      [
        { speaker: "まりん", text: "曖昧な言い方で誤魔化さないで" },
        { speaker: "まりん", text: "亡くなった人をフルネームを答えて" },
      ],
    ],
  },

  まりん: {
    dialogue: [
      [
        { speaker: "まりん", text: "ん？　呼んだ？" },
        { speaker: "はじめ", text: "呼んだだけ" },
      ],
      [
        { speaker: "まりん", text: "えー、なにそれ？" },
        { speaker: "まりん", text: "ホントに呼んだだけ？" },
      ],
      [
        { speaker: "はじめ", text: "呼びたかっただけじゃダメ？" },
        { speaker: "まりん", text: "なにそれメロい" },
      ],
    ],
  },

  はじめ: {
    dialogue: [
      [
        { speaker: "まりん", text: "【はじめの名前】、書きやすすぎる" },
        { speaker: "はじめ", text: "画数１しかないからね" },
      ],
      [
        { speaker: "まりん", text: "色紙にサインするのも楽そうだね" },
        { speaker: "はじめ", text: "どういうシチュエーション？" },
      ],
      [
        { speaker: "まりん", text: "将来、有名人になるかもじゃん？" },
        { speaker: "はじめ", text: "可能性は限りなく低いけど……" },
      ],
      [
        { speaker: "まりん", text: "人生、何があるかわからないし" },
        { speaker: "まりん", text: "今のうちにサインを考えといて……" },
      ],
      [
        { speaker: "まりん", text: "コンビ名も決めておこうよ" },
        { speaker: "はじめ", text: "お笑い芸人確定だこれ" },
      ],
    ],
  },

  一: {
    dialogue: [
      [
        { speaker: "まりん", text: "『一』と書いて、はじめと読む" },
        { speaker: "まりん", text: "なんて思い切りのいい名前" },
      ],
      [
        { speaker: "まりん", text: "それに比べて【私の名前】の長さ！" },
        { speaker: "まりん", text: "テストのとき、毎回大変すぎる" },
      ],
      [
        { speaker: "まりん", text: "万里か杏音のどっちかでいいもん" },
        { speaker: "はじめ", text: "私はカワイイと思うけどな" },
      ],
      [
        { speaker: "まりん", text: "だから、すごく嬉しかったんだよ" },
        { speaker: "まりん", text: "はじめが、あだ名をつけて" },
      ],
      [
        { speaker: "はじめ", text: "思えば、仲良くなったのって" },
        { speaker: "はじめ", text: "まりんにあだ名をつけてからだよね" },
      ],
      [
        { speaker: "まりん", text: "いやまー、実は逆なんだよ" },
        { speaker: "はじめ", text: "逆って……？" },
      ],
      [
        { speaker: "まりん", text: "はじめと友達になりたかったから" },
        { speaker: "まりん", text: "あだ名つけてって言ったんだよね" },
      ],
      [
        { speaker: "はじめ", text: "え、そうだったの！？" },
        { speaker: "まりん", text: "そうなんだよね……あはは" },
      ],
    ],
  },

  万里杏音: {
    dialogue: [
      [
        { speaker: "まりん", text: "私は自我の目覚めが早かった" },
        { speaker: "まりん", text: "自分の名前に疑問を持つのも……" },
      ],
      [
        { speaker: "はじめ", text: "万里杏音って可愛いのに" },
        { speaker: "まりん", text: "まあまあ、仮に可愛いとして……" },
      ],
      [
        { speaker: "まりん", text: "私がお姫さまならよかったけど" },
        { speaker: "まりん", text: "幼稚園のとき、よく言われてたんだよ" },
      ],
      [
        { speaker: "まりん", text: "お姫さまみたいな名前なのに" },
        { speaker: "まりん", text: "恐竜が好きなのは変だって……" },
      ],
      [
        { speaker: "まりん", text: "そうしたら、全然変じゃないって" },
        { speaker: "まりん", text: "はじめが言い返してくれたんだよ" },
      ],
      [
        { speaker: "まりん", text: "そりゃ、友達になりたくなるって" },
        { speaker: "はじめ", text: "ごめん、完全に忘れてる……" },
      ],
      [
        { speaker: "はじめ", text: "私、まりんを責められないじゃん" },
        { speaker: "まりん", text: "幼稚園の話だし、そんなもんでしょ" },
      ],
    ],
  },

  献花: {
    dialogue: [
      [
        { speaker: "まりん", text: "駄菓子屋さんの角に置かれてた花束" },
        { speaker: "まりん", text: "あれって献花だよね……？" },
      ],
      [
        { speaker: "まりん", text: "色んな花が束ねられてたけど" },
        { speaker: "まりん", text: "【はじめの名字の花】もあったな……" },
      ],
      [
        { speaker: "まりん", text: "花言葉は、悲しみに寄り添うだっけ？" },
        { speaker: "はじめ", text: "うん……" },
      ],
      [
        { speaker: "まりん", text: "キレイな花だよね。私は好き" },
        { speaker: "はじめ", text: "……………………" },
      ],
    ],
  },

  竜胆: {
    dialogue: [
      [
        { speaker: "まりん", text: "竜胆かぁ……いい響き" },
        { speaker: "はじめ", text: "そんなほめても何も出ないよ" },
      ],
      [
        { speaker: "まりん", text: "【私の名字】も、お花ならよかったな" },
        { speaker: "まりん", text: "だって、完全に第六天魔王じゃん" },
      ],
      [
        { speaker: "はじめ", text: "ちょっ……まあ、そうだけど……" },
        { speaker: "はじめ", text: "かっこいいと思うよ、天下人だし" },
      ],
      [
        { speaker: "はじめ", text: "初対面でも絶対に覚えてもらえるし" },
        { speaker: "まりん", text: "ふふふ。くるしゅうない……" },
      ],
      [
        { speaker: "まりん", text: "まあ、子孫とかじゃないらしいけど" },
        { speaker: "はじめ", text: "あ、そうなんだ" },
      ],
    ],
  },

  織田: {
    dialogue: [
      [
        { speaker: "まりん", text: "織田……織田かぁ……" },
        { speaker: "はじめ", text: "そんなにコンプレックスある？" },
      ],
      [
        { speaker: "まりん", text: "色々と言われたもんだよ" },
        { speaker: "まりん", text: "比叡山、焼き討ちするなとか" },
      ],
      [
        { speaker: "まりん", text: "何回も裏切られてやんのとか" },
        { speaker: "はじめ", text: "からかい方が歴史的すぎる" },
      ],
      [
        { speaker: "まりん", text: "おかげで信ちゃんに詳しくなったよ" },
        { speaker: "はじめ", text: "いや、馴れ馴れしい呼び方" },
      ],
      [
        { speaker: "まりん", text: "まあ、明智や石田よりはマシか" },
        { speaker: "はじめ", text: "明智さんと石田さんに失礼すぎる" },
      ],
    ],
  },

  織田万里杏音: {
    dialogue: [
      [
        { speaker: "はじめ", text: "まりんは……" },
        { speaker: "はじめ", text: "織田万里杏音は、お店の角で……" },
      ],
      [
        { speaker: "はじめ", text: "………………" },
        { speaker: "まりん", text: "ねえ、はじめ" },
      ],
      [
        { speaker: "まりん", text: "【私の好きな漫画っぽく言ってよ】" },
        { speaker: "はじめ", text: "え、なにそれ……！？" },
      ],
      [
        { speaker: "まりん", text: "１回、言われてみたかったんだよね" },
        { speaker: "まりん", text: "今がベストのタイミングじゃん" },
      ],
      [
        { speaker: "はじめ", text: "ふ、ふざけないでよ！" },
        { speaker: "まりん", text: "ないない。ふざけてない" },
      ],
      [
        { speaker: "まりん", text: "だって、湿っぽいのイヤじゃん" },
        { speaker: "はじめ", text: "だからって……" },
      ],
      [
        { speaker: "まりん", text: "あ、そうだ。あとひとつ。" },
        { speaker: "まりん", text: "私のどこを好きになっちゃったの？" },
      ],
      [
        { speaker: "はじめ", text: "今更、そんな恥ずいこと言わせる！？" },
        { speaker: "まりん", text: "聞きたい、聞きたい～！" },
      ],
      [
        { speaker: "はじめ", text: "ええ……でもなぁ……" },
        { speaker: "はじめ", text: "…………………………" },
      ],
      [
        { speaker: "まりん", text: "はじめの視線がねっとりして気が……" },
        { speaker: "まりん", text: "もしかして【エロい話】？" },
      ],
      [
        { speaker: "はじめ", text: "うぐっ……" },
        { speaker: "まりん", text: "あ、ホントに【エロい話】なんだ" },
      ],
    ],
  },

  エロい話: {
    dialogue: [
      [
        { speaker: "まりん", text: "ねえ、私のどこにドキッとしたの？" },
        { speaker: "はじめ", text: "……………………" },
      ],
      [
        { speaker: "はじめ", text: "全体的に……" },
        { speaker: "まりん", text: "いやいや、誤魔化さずに" },
      ],
      [
        { speaker: "はじめ", text: "つまり、その……" },
        { speaker: "はじめ", text: "まりんは私にとって憧れの存在なの" },
      ],
      [
        { speaker: "まりん", text: "おお、それは素直に照れるね" },
        { speaker: "はじめ", text: "明るくて、才能あって、活動的で……" },
      ],
      [
        { speaker: "はじめ", text: "でも正直、眩しすぎるときがあるの" },
        { speaker: "まりん", text: "おっと、話変わってきたな……" },
      ],
      [
        { speaker: "はじめ", text: "教授と楽しそうに電話してる時とか" },
        { speaker: "はじめ", text: "真面目に論文を読んでる時とか" },
      ],
      [
        { speaker: "はじめ", text: "その横顔を眺めていると" },
        { speaker: "はじめ", text: "なんだか胸の奥がざわざわして……" },
      ],
      [
        { speaker: "はじめ", text: "いきなり無言で押し倒して……" },
        { speaker: "はじめ", text: "めちゃくちゃにしてやりたくなる" },
      ],
      [
        { speaker: "はじめ", text: "私のいる暗くて低い場所まで" },
        { speaker: "はじめ", text: "引きずり落としたくなるの" },
      ],
      [
        { speaker: "まりん", text: "……………………" },
        { speaker: "まりん", text: "それは……初めて聞いた" },
      ],
      [
        { speaker: "はじめ", text: "まあ、やらなかったけどね" },
        { speaker: "はじめ", text: "まりんの夢を邪魔しちゃうから" },
      ],
      [
        { speaker: "はじめ", text: "…………ごめん" },
        { speaker: "はじめ", text: "気持ち悪いよね……" },
      ],
      [
        { speaker: "はじめ", text: "…………" },
        { speaker: "まりん", text: "…………" },
      ],
      [
        { speaker: "はじめ", text: "……………………" },
        { speaker: "まりん", text: "……………………" },
      ],
      [
        { speaker: "まりん", text: "今ならしていいよ" },
        { speaker: "まりん", text: "【めちゃくちゃのぐちゃぐちゃ】に" },
      ],
      [
        { speaker: "はじめ", text: "……ホントにするよ？" },
        { speaker: "まりん", text: "うん……" },
      ],
      [
        { speaker: "はじめ", text: "手加減できないからね？" },
        { speaker: "まりん", text: "お、お手柔らかに……" },
      ],
    ],
  },

  北斗の拳: {
    dialogue: [
      [
        { speaker: "はじめ", text: "スマホで読んでるの、漫画？" },
        { speaker: "まりん", text: "北斗の拳。アタタター！！" },
      ],
      [
        { speaker: "はじめ", text: "前から好きだよね。何きっかけ？" },
        { speaker: "まりん", text: "こういうのは大体パパだね" },
      ],
      [
        { speaker: "まりん", text: "普通に単行本がうちにあるんだけど" },
        { speaker: "まりん", text: "思い切って電子書籍でも買っちゃった" },
      ],
      [
        { speaker: "まりん", text: "肩こってたら、私に教えてね" },
        { speaker: "まりん", text: "秘孔を突いて、治してあげるから" },
      ],
      [
        { speaker: "はじめ", text: "やだ。全身バラバラになる" },
        { speaker: "まりん", text: "へーきへーき。私、天才だから" },
      ],
      [
        { speaker: "はじめ", text: "そういうやつが一番ヤバい！" },
        { speaker: "まりん", text: "ふふふ、痛いのは一瞬だよ……" },
      ],
    ],
  },

  お前はもう死んでいる: {
    dialogue: [
      [
        { speaker: "はじめ", text: "言うよ……？" },
        { speaker: "まりん", text: "うん……" },
      ],
      [
        { speaker: "はじめ", text: "………………" },
        { speaker: "はじめ", text: "お前はもう死んでいる" },
      ],
      [
        { speaker: "まりん", text: "ああ……うん……" },
        { speaker: "まりん", text: "やっぱりそうなんだね" },
      ],
      [
        { speaker: "はじめ", text: "満足してくれた？" },
        { speaker: "まりん", text: "そりゃもう大満足よ" },
      ],
      [
        { speaker: "はじめ", text: "まりんが私の唇にキスをして" },
        { speaker: "はじめ", text: "そのままイギリスに行っちゃって……" },
      ],
      [
        { speaker: "はじめ", text: "やっと帰ってきたのは" },
        { speaker: "はじめ", text: "３学期が始まってからだったし……" },
      ],
      [
        { speaker: "まりん", text: "だんだん思い出してきた……" },
        { speaker: "はじめ", text: "その節は申し訳ありませんでした" },
      ],
      [
        { speaker: "はじめ", text: "いいよ、ちゃんと仲直りしたから" },
        { speaker: "まりん", text: "あー、はいはい！" },
      ],
      [
        { speaker: "まりん", text: "土下座したの思い出した" },
        { speaker: "まりん", text: "学校の廊下で……" },
      ],
      [
        { speaker: "はじめ", text: "あれは恥ずかしかった……" },
        { speaker: "まりん", text: "その節についても申し訳ありません" },
      ],
      [
        { speaker: "はじめ", text: "で、仲直りした日に私が誘ったんだよ" },
        { speaker: "はじめ", text: "久しぶりに駄菓子屋へ行こうって……" },
      ],
      [
        { speaker: "はじめ", text: "そうしたら、道路のちょうど真ん中に" },
        { speaker: "はじめ", text: "ケガした子猫がうずくまってて……" },
      ],
      [
        { speaker: "まりん", text: "私は子猫を助けて、死んじゃったと" },
        { speaker: "はじめ", text: "うん、私にその子猫を預けて……" },
      ],
      [
        { speaker: "まりん", text: "化石を掘る前に、自分が骨になるとは" },
        { speaker: "はじめ", text: "バカ！　バカ幽霊！" },
      ],
      [
        { speaker: "はじめ", text: "私が駄菓子屋に誘ったから……" },
        { speaker: "はじめ", text: "まりんは……まりんは……" },
      ],
      [
        { speaker: "まりん", text: "はじめが友達でよかったって" },
        { speaker: "まりん", text: "私は心の底から思ってるよ" },
      ],
      [
        { speaker: "はじめ", text: "私だって……そう思ってる" },
        { speaker: "まりん", text: "だったら、笑顔でお別れしようよ" },
      ],
      [
        { speaker: "はじめ", text: "……………………" },
        { speaker: "はじめ", text: "そうか……そうだよね……" },
      ],
      [
        { speaker: "はじめ", text: "まりんは死んでるって、言えなかった" },
        { speaker: "はじめ", text: "毎日、自分をごまかしてた" },
      ],
      [
        { speaker: "はじめ", text: "でも、ちゃんとお別れできないと" },
        { speaker: "はじめ", text: "まりんも次に進めないよね" },
      ],
      [
        { speaker: "まりん", text: "はじめ……" },
        { speaker: "はじめ", text: "わかった。笑顔でお別れしよう" },
      ],
      [
        { speaker: "まりん", text: "ありがとう" },
        { speaker: "はじめ", text: "うん……" },
      ],
      [
        { speaker: "まりん", text: "じゃあね、はじめ" },
        { speaker: "まりん", text: "【また会う日まで】" },
      ],
    ],
  },

  進路: {
    dialogue: [
      [
        { speaker: "まりん", text: "進路調査票、書きましたっと……" },
        { speaker: "まりん", text: "これ一択だから簡単だけどね" },
      ],
      [
        { speaker: "まりん", text: "はじめは今のところ進学？" },
        { speaker: "はじめ", text: "まあ、進学校だから……" },
      ],
      [
        { speaker: "はじめ", text: "それに……" },
        { speaker: "まりん", text: "それに？" },
      ],
      [
        { speaker: "はじめ", text: "ううん、なんでもない" },
        { speaker: "まりん", text: "えっ？　気になる気になる！" },
      ],
      [
        { speaker: "はじめ", text: "会話が弾んだら教えるよ" },
        { speaker: "まりん", text: "恋愛ゲーム始まった" },
      ],
    ],
  },

  三葉虫: {
    dialogue: [
      [
        { speaker: "まりん", text: "三葉虫、飼いたくない？" },
        { speaker: "はじめ", text: "ほぼデカい虫はちょっと……" },
      ],
      [
        { speaker: "まりん", text: "じゃあ、アノマロカリスは？" },
        { speaker: "はじめ", text: "いや、もっとデカくなってる！？" },
      ],
      [
        { speaker: "まりん", text: "オパビニアは？" },
        { speaker: "はじめ", text: "目が多いのも、ちょっと……" },
      ],
      [
        { speaker: "まりん", text: "ふふ、はじめも詳しくなってきたね" },
        { speaker: "はじめ", text: "四六時中、まりんの話を聞いてたらね" },
      ],
      [
        { speaker: "まりん", text: "英才教育の賜だったか" },
        { speaker: "はじめ", text: "私の狭い記憶領域が圧迫される……" },
      ],
    ],
  },

  論文: {
    dialogue: [
      [
        { speaker: "まりん", text: "最新の論文をスマホで簡単に読める" },
        { speaker: "まりん", text: "いい時代になったもんだね" },
      ],
      [
        { speaker: "はじめ", text: "いや、私らデジタルネイティブでしょ" },
        { speaker: "はじめ", text: "というか、なんの論文？" },
      ],
      [
        { speaker: "まりん", text: "ティラノサウルス集団生活説の論文" },
        { speaker: "はじめ", text: "うわ、全部英語だ！" },
      ],
      [
        { speaker: "まりん", text: "大好きな昔の生き物を学びながら" },
        { speaker: "まりん", text: "英語も学べて一石二鳥ってわけ" },
      ],
      [
        { speaker: "はじめ", text: "【勉強】が楽しいって感覚" },
        { speaker: "はじめ", text: "私には一生わからないかも……" },
      ],
    ],
  },

  ドーナッツ: {
    dialogue: [
      [
        { speaker: "まりん", text: "まーたドーナッツ食べてるよ" },
        { speaker: "はじめ", text: "と、糖分は脳に必須だから……" },
      ],
      [
        { speaker: "まりん", text: "おなか、ぽよってんじゃない？" },
        { speaker: "はじめ", text: "生まれてこの方スレンダーです" },
      ],
      [
        { speaker: "はじめ", text: "まりんは何か、おやつないの？" },
        { speaker: "まりん", text: "最近おなか空かないんだよね" },
      ],
      [
        { speaker: "はじめ", text: "あぁ、その……ダイエット的な？" },
        { speaker: "まりん", text: "そういうわけじゃないけど……" },
      ],
      [
        { speaker: "まりん", text: "はじめの美味しそうに食べる姿を" },
        { speaker: "まりん", text: "見てるだけで満足って感じ……？" },
      ],
      [
        { speaker: "まりん", text: "いっぱい食べて、大きくなるんだぞ" },
        { speaker: "はじめ", text: "ちょっとは控えようかな……" },
      ],
    ],
  },

  学級委員長: {
    dialogue: [
      [
        { speaker: "はじめ", text: "明日の委員会、すっかり忘れてた" },
        { speaker: "まりん", text: "学級委員長さんは大変だねえ" },
      ],
      [
        { speaker: "はじめ", text: "これも内申点稼ぎのため……" },
        { speaker: "まりん", text: "よくやるよー。私には絶対ムリ！" },
      ],
      [
        { speaker: "はじめ", text: "実際はあんまり忙しくないよ" },
        { speaker: "はじめ", text: "先生に言われてプリント配ったりとか" },
      ],
      [
        { speaker: "はじめ", text: "まあ、一番大変なのは……" },
        { speaker: "はじめ", text: "陽キャのギャルを見張ることかな" },
      ],
      [
        { speaker: "まりん", text: "陽キャのギャルって私のこと？？？" },
        { speaker: "はじめ", text: "まりん以外に誰がいるの？" },
      ],
      [
        { speaker: "まりん", text: "私が本当に陽キャだったら" },
        { speaker: "まりん", text: "友達作りに作戦立てたりしないから" },
      ],
      [
        { speaker: "はじめ", text: "それ、いつの話？" },
        { speaker: "まりん", text: "いやまあ、幼稚園とか……" },
      ],
    ],
  },

  眼鏡: {
    dialogue: [
      [
        { speaker: "まりん", text: "はじめはコンタクトにしないの？" },
        { speaker: "はじめ", text: "私は永遠の眼鏡派だからね" },
      ],
      [
        { speaker: "まりん", text: "またまたー" },
        { speaker: "まりん", text: "本当はコンタクトが怖いんでしょ？" },
      ],
      [
        { speaker: "はじめ", text: "こ、怖くないし！　それに……" },
        { speaker: "まりん", text: "それに……？" },
      ],
      [
        { speaker: "はじめ", text: "いや、言わない" },
        { speaker: "まりん", text: "えー、なんでなんで？" },
      ],
      [
        { speaker: "はじめ", text: "……………………" },
        { speaker: "はじめ", text: "小２で初めて眼鏡かけたじゃん？" },
      ],
      [
        { speaker: "はじめ", text: "クラスメイトにからかわれるかもって" },
        { speaker: "はじめ", text: "すごく不安だったんだけど……" },
      ],
      [
        { speaker: "はじめ", text: "まりんが一番に言ってくれたよね" },
        { speaker: "はじめ", text: "私は眼鏡が似合ってるって……" },
      ],
      [
        { speaker: "まりん", text: "ほほーう。小２の私、やるね" },
        { speaker: "まりん", text: "人の自己肯定感を上げるのが上手い！" },
      ],
      [
        { speaker: "まりん", text: "はじめも可愛いとこ、ありますなぁ" },
        { speaker: "まりん", text: "だから言いたくなかったのに……" },
      ],
    ],
  },

  ママ: {
    dialogue: [
      [
        { speaker: "まりん", text: "ママからLINEきてた" },
        { speaker: "はじめ", text: "へー、なんて？" },
      ],
      [
        { speaker: "まりん", text: "まーた出張先から帰ってこれないって" },
        { speaker: "はじめ", text: "そろそろ新作発表会だっけ？" },
      ],
      [
        { speaker: "まりん", text: "ファッションデザイナーの宿命だよ" },
        { speaker: "はじめ", text: "ホントすごいよね、まりんのお母さん" },
      ],
      [
        { speaker: "まりん", text: "まあ、尊敬できる人ではあるかな" },
        { speaker: "まりん", text: "子供のネーミングセンス以外は……" },
      ],
      [
        { speaker: "はじめ", text: "は、はは……" },
        { speaker: "まりん", text: "はじめのママはどう？" },
      ],
      [
        { speaker: "はじめ", text: "うちは普通の専業主婦だからなー" },
        { speaker: "はじめ", text: "【勉強】のことで小うるさいくらい" },
      ],
      [
        { speaker: "はじめ", text: "ちゃんとついていけてるの？　ってさ" },
        { speaker: "まりん", text: "はじめのママ、心配性だもんね" },
      ],
      [
        { speaker: "まりん", text: "【パパ】の方はどうなの？" },
        { speaker: "はじめ", text: "あー、あの人ね……" },
      ],
    ],
  },

  パパ: {
    dialogue: [
      [
        { speaker: "まりん", text: "はじめのパパ、今はどうなの？" },
        { speaker: "はじめ", text: "あー、あの人ね……" },
      ],
      [
        { speaker: "はじめ", text: "不倫が発覚したときは大変だったけど" },
        { speaker: "まりん", text: "はじめ、ツラそうだったもんね……" },
      ],
      [
        { speaker: "はじめ", text: "私が大学を出るまでは離婚しない" },
        { speaker: "はじめ", text: "って話に落ち着いたからいいけどさ" },
      ],
      [
        { speaker: "はじめ", text: "ま、信用が戻ることはないね" },
        { speaker: "まりん", text: "性欲は人間関係を壊しますなぁ" },
      ],
      [
        { speaker: "はじめ", text: "……………………" },
        { speaker: "まりん", text: "ごめん、この話はダメだったね" },
      ],
      [
        { speaker: "はじめ", text: "まりんのお父さんはどうなの？" },
        { speaker: "まりん", text: "あー、気ままに小説家やってるよ" },
      ],
      [
        { speaker: "まりん", text: "なんか今度、映画化するみたい" },
        { speaker: "はじめ", text: "また！？　去年もしてたよね" },
      ],
      [
        { speaker: "はじめ", text: "ホント、ベストセラー作家って感じ" },
        { speaker: "まりん", text: "でも、ひとつだけ悩みがあって……" },
      ],
      [
        { speaker: "まりん", text: "私が遠出するたび胃がヤバいみたい" },
        { speaker: "はじめ", text: "その気持ちはわかる" },
      ],
    ],
  },

  スリジャヤワルダナプラコッテ: {
    dialogue: [
      [
        { speaker: "まりん", text: "スリランカの首都は……" },
        { speaker: "まりん", text: "スリジャヤワルダナプラコッテですぜ" },
      ],
      [
        { speaker: "はじめ", text: "あー、それ！　それだー！" },
        { speaker: "まりん", text: "思い出せてスッキリした？" },
      ],
      [
        { speaker: "はじめ", text: "これで【勉強】に集中できる" },
        { speaker: "まりん", text: "そいつはよかったよかった" },
      ],
      [
        { speaker: "まりん", text: "じゃあ、ピカソのフルネームは？" },
        { speaker: "はじめ", text: "いや、惑わすな惑わすな" },
      ],
      [
        { speaker: "まりん", text: "なんとピカソのフルネームは……" },
        { speaker: "まりん", text: "…………………ど忘れしちゃった" },
      ],
      [
        { speaker: "はじめ", text: "逆になんで暗記してたの？" },
        { speaker: "まりん", text: "ドヤれるかと思って……" },
      ],
      [
        { speaker: "まりん", text: "でも、なんで忘れちゃったんだろう？" },
        { speaker: "はじめ", text: "そんなこと、よくあるでしょ" },
      ],
    ],
  },

  彼氏: {
    dialogue: [
      [
        { speaker: "まりん", text: "２組の高木さん、彼氏ができたってさ" },
        { speaker: "はじめ", text: "高木さん is 誰……？" },
      ],
      [
        { speaker: "はじめ", text: "あと、そもそもの話……" },
        { speaker: "はじめ", text: "誰に彼氏ができたとか興味ない" },
      ],
      [
        { speaker: "まりん", text: "実を言うと、私も興味ない" },
        { speaker: "はじめ", text: "じゃあ、なんで話題に出したの？" },
      ],
      [
        { speaker: "まりん", text: "私、いつも昔の話ばっかりしてるから" },
        { speaker: "まりん", text: "たまには普通のＪＫらしい話題も……" },
      ],
      [
        { speaker: "はじめ", text: "まりんに普通は求めてないから" },
        { speaker: "はじめ", text: "別に今のままでいいよ" },
      ],
      [
        { speaker: "まりん", text: "はじめ、心の友よ……" },
        { speaker: "はじめ", text: "大げさ、大げさ" },
      ],
      [
        { speaker: "まりん", text: "じゃあ、メガテリウムの話するね" },
        { speaker: "はじめ", text: "これ長くなるやつだ……" },
      ],
    ],
  },

  バイト: {
    dialogue: [
      [
        { speaker: "まりん", text: "私といっしょにバイトしない？" },
        { speaker: "はじめ", text: "え、唐突になに？" },
      ],
      [
        { speaker: "はじめ", text: "まりん、バイトしたいの？" },
        { speaker: "まりん", text: "ふふふ……まあね" },
      ],
      [
        { speaker: "まりん", text: "親や大人のお金で海外三昧って……" },
        { speaker: "まりん", text: "流石に申し訳ないと思ってさ" },
      ],
      [
        { speaker: "はじめ", text: "リアルお嬢さまと思えない謙虚な発言" },
        { speaker: "まりん", text: "で、もしバイトするなら何する？" },
      ],
      [
        { speaker: "はじめ", text: "……………………" },
        { speaker: "はじめ", text: "………メイド喫茶" },
      ],
      [
        { speaker: "まりん", text: "はじめのメイド服、見たすぎ！" },
        { speaker: "はじめ", text: "いや、私が着たいわけじゃないよ？" },
      ],
      [
        { speaker: "はじめ", text: "可愛い子を近くで見たいだけで……" },
        { speaker: "まりん", text: "へー、そんな願望あったんだ" },
      ],
      [
        { speaker: "はじめ", text: "言わなきゃよかった……" },
        { speaker: "まりん", text: "そのうち文化祭とかで着てあげるよ♥" },
      ],
    ],
  },

  部活: {
    dialogue: [
      [
        { speaker: "まりん", text: "はじめは部活に興味あるの？" },
        { speaker: "はじめ", text: "入りたい部活はあったよ" },
      ],
      [
        { speaker: "はじめ", text: "授業についていくのが大変すぎて" },
        { speaker: "はじめ", text: "余裕なくて諦めたけどね" },
      ],
      [
        { speaker: "まりん", text: "【はじめの入りたかった部活】ね" },
        { speaker: "まりん", text: "当ててみるから、ヒントちょうだい" },
      ],
      [
        { speaker: "はじめ", text: "文化部。運動部は、もうこりごり" },
        { speaker: "まりん", text: "中学はソフト部で泣いてたもんね" },
      ],
      [
        { speaker: "はじめ", text: "あと私の好きなものが楽しめる" },
        { speaker: "まりん", text: "ほうほう、これは大ヒント……" },
      ],
      [
        { speaker: "はじめ", text: "で、日本文化っぽいところね" },
        { speaker: "まりん", text: "あー、もうわかった！" },
      ],
    ],
  },

  茶道部: {
    dialogue: [
      [
        { speaker: "まりん", text: "はじめの入りたかった部活は……" },
        { speaker: "まりん", text: "茶道部、これで決まりでしょ" },
      ],
      [
        { speaker: "はじめ", text: "うーん……正解は……" },
        { speaker: "まりん", text: "茶道部で正解っ！" },
      ],
      [
        { speaker: "まりん", text: "はじめは甘い物が大好き" },
        { speaker: "まりん", text: "加えて日本文化的な部といったらね" },
      ],
      [
        { speaker: "まりん", text: "はじめ博士の私には楽勝だよ" },
        { speaker: "はじめ", text: "はじめ博士ってなに……？" },
      ],
      [
        { speaker: "はじめ", text: "はぁ。お茶菓子、食べたかったな" },
        { speaker: "はじめ", text: "授業のレベルが高くなければなぁ……" },
      ],
      [
        { speaker: "まりん", text: "ま、あとで抹茶パフェでも食べましょ" },
        { speaker: "はじめ", text: "よーし、今は頑張る！" },
      ],
    ],
  },

  ラムネ: {
    dialogue: [
      [
        { speaker: "まりん", text: "糖分不足のはじめにラムネあげるね" },
        { speaker: "はじめ", text: "天の恵みに感謝……！" },
      ],
      [
        { speaker: "はじめ", text: "ああ、ブドウ糖が疲れた脳に効く……" },
        { speaker: "まりん", text: "キマってんねえ" },
      ],
      [
        { speaker: "はじめ", text: "大丈夫。依存性はないから" },
        { speaker: "まりん", text: "一番ダメなやつだ、これ" },
      ],
      [
        { speaker: "はじめ", text: "あとひとつ……あとひとつ……" },
        { speaker: "まりん", text: "末端価格、ひとつ３万円です" },
      ],
      [
        { speaker: "まりん", text: "身体で払ってもいいよ？" },
        { speaker: "はじめ", text: "おじさんは無視無視……" },
      ],
    ],
  },
};

const repeatedAfterEroDialogues = [
  // 1回目
  [
    [
      { speaker: "はじめ", text: "おつかれさまでした" },
      { speaker: "まりん", text: "はじめ、なんか慣れてない？" },
    ],
    [
      { speaker: "はじめ", text: "言っておくけど、私も初めてだから" },
      { speaker: "まりん", text: "つまり、はじめは生まれつき床上手" },
    ],
    [
      { speaker: "はじめ", text: "こんなことばっか上手くてもね……" },
      { speaker: "まりん", text: "でも、私は嬉しかったよ" },
    ],
    [
      { speaker: "はじめ", text: "……………………" },
      { speaker: "はじめ", text: "あまりおだてると、また押し倒すよ？" },
    ],
  ],

  // 2回目
  [
    [
      { speaker: "はじめ", text: "はい、おつかれさま" },
      { speaker: "まりん", text: "はじめってＳだったの……？" },
    ],
    [
      { speaker: "はじめ", text: "私は憧れの対象を汚したいだけ" },
      { speaker: "まりん", text: "しくしく、汚されちゃった……" },
    ],
    [
      { speaker: "まりん", text: "もう、お嫁に行けないかも……" },
      { speaker: "はじめ", text: "まだ余裕あるみたいだね" },
    ],
    [
      { speaker: "まりん", text: "いや、割と疲れてるけど……？" },
      { speaker: "はじめ", text: "問答無用" },
    ],
  ],

  // 3回目
  [
    [
      { speaker: "まりん", text: "……………………" },
      { speaker: "まりん", text: "…………はっ。気を失ってた" },
    ],
    [
      { speaker: "はじめ", text: "初めてで気絶なんてすごいね" },
      { speaker: "まりん", text: "いや、はじめが上手すぎて……" },
    ],
    [
      { speaker: "はじめ", text: "まりんが敏感すぎるんだよ" },
      { speaker: "まりん", text: "こ、今度は私が攻める！" },
    ],
    [
      { speaker: "はじめ", text: "やってみたら、子猫ちゃん？" },
      { speaker: "まりん", text: "あーもう、バカにして！" },
    ],
  ],

  // 4回目
  [
    [
      { speaker: "まりん", text: "ま、待って……流石に腰が……" },
      { speaker: "はじめ", text: "残念。逆転できなかったね" },
    ],
    [
      { speaker: "まりん", text: "大体、女同士でする場合って" },
      { speaker: "まりん", text: "どうなったら終わりになるわけ？" },
    ],
    [
      { speaker: "はじめ", text: "それは双方が心身ともに疲れ切って" },
      { speaker: "はじめ", text: "指一本も動かせなくなったら……？" },
    ],
    [
      { speaker: "まりん", text: "そんなのほぼ無限じゃん" },
      { speaker: "はじめ", text: "うん、だから無限にしよう？" },
    ],
  ],

  // 5回目以降
  [
    [
      { speaker: "まりん", text: "またしちゃった……" },
      { speaker: "はじめ", text: "すっかりハマっちゃったね" },
    ],
    [
      { speaker: "まりん", text: "……ありがと、はじめ" },
      { speaker: "まりん", text: "今、すっごい幸せな気分" },
    ],
    [
      { speaker: "はじめ", text: "私も……今が一番満たされてる" },
      { speaker: "まりん", text: "よかった。満足してもらえて" },
    ],
    [
      { speaker: "はじめ", text: "好きだよ、まりん" },
      { speaker: "まりん", text: "うん、私も……" },
    ],
    [
      { speaker: "はじめ", text: "……もう１回しちゃう？" },
      { speaker: "まりん", text: "えー、またするの？" },
    ],
    [
      { speaker: "はじめ", text: "まだしてないプレイ、色々あるし……" },
      { speaker: "まりん", text: "プレイって言わないで、プレイって！" },
    ],
  ],
];

const endingDialogue = [
  { speaker: "　", text: "クリアおつかれさまでした" },
  { speaker: "　", text: "最後のキーワード【お別れは笑顔で】" },
];

const specialKeywordListItems = [
  "めちゃくちゃのぐちゃぐちゃ",
  "また会う日まで",
  "お別れは笑顔で",
];

const rawKeywordListItems = [
  ...[...new Set(breakMessages.map((item) => item.keyword))]
    .filter((keyword) => !quizData[keyword])
    .map((keyword) => ({
      type: "normal",
      keyword: keyword,
    })),

  ...Object.keys(keywordDialogues)
    .filter(
      (keyword) =>
        !Object.values(quizData).some((data) => data.answer === keyword),
    )
    .map((keyword) => ({
      type: "normal",
      keyword: keyword,
    })),

  ...Object.entries(quizData).map(([question, data]) => ({
    type: "quiz",
    question: question,
    answer: data.answer,
  })),

  ...specialKeywordListItems.map((keyword) => ({
    type: "normal",
    keyword: keyword,
  })),
];

const keywordListItems = rawKeywordListItems.filter((item, index, array) => {
  const key =
    item.type === "quiz" ? `quiz:${item.question}` : `normal:${item.keyword}`;

  return (
    array.findIndex((other) => {
      const otherKey =
        other.type === "quiz"
          ? `quiz:${other.question}`
          : `normal:${other.keyword}`;

      return otherKey === key;
    }) === index
  );
});
