/* サイトを開いた直後専用のセリフ */
const idleMessages = [
  [
    { speaker: "まりん", text: "のんびりやりますか" },
    { speaker: "はじめ", text: "集中、集中……" },
  ],

  [
    { speaker: "まりん", text: "チルい曲でも流す？" },
    { speaker: "はじめ", text: "じゃ、いつもので" },
  ],

  [
    { speaker: "まりん", text: "あああああ" },
    { speaker: "はじめ", text: "あああああ" },
  ],

  [
    { speaker: "はじめ", text: "あああああ" },
    { speaker: "まりん", text: "あああああ" },
  ],

  [
    { speaker: "はじめ", text: "じゃ、始めようか" },
    { speaker: "まりん", text: "はいはーい" },
  ],

  [
    { speaker: "はじめ", text: "また、あくびしてる" },
    { speaker: "まりん", text: "お昼寝日和すぎて……" },
  ],
];

/* 作業時のセリフ一覧 */
const messages = [
  [
    { speaker: "まりん", text: "あ！　新しい論文、出てるじゃん" },
    { speaker: "はじめ", text: "なにそのコンビニの新商品的なノリ" },
  ],

  [
    { speaker: "まりん", text: "最近、猫に好かれるんだよね" },
    { speaker: "はじめ", text: "おいしそうな匂いしてるんじゃない？" },
  ],

  [
    { speaker: "まりん", text: "ブロントサウルスよ、よみがえれ……" },
    { speaker: "はじめ", text: "どういう復活の儀式？" },
  ],

  [
    { speaker: "まりん", text: "三葉虫、飼いたくない？" },
    { speaker: "はじめ", text: "いや、キモいって……" },
  ],

  [
    { speaker: "まりん", text: "落とし物、交番に届けてきた" },
    { speaker: "はじめ", text: "偉いじゃん" },
  ],

  [
    { speaker: "はじめ", text: "ホント毎日、私の部屋に来るよね" },
    { speaker: "まりん", text: "だって、居心地いいじゃん" },
  ],
];

/* 休憩中専用のセリフ一覧 */
const breakMessages = [
  {
    keyword: "勉強",
    dialogue: [
      { speaker: "まりん", text: "なぜ人は【勉強】するのか……" },
      { speaker: "はじめ", text: "え、急に哲学者になった？" },
    ],
  },

  {
    keyword: "勉強",
    dialogue: [
      { speaker: "まりん", text: "なぜ人は【勉強】するのか……" },
      { speaker: "はじめ", text: "え、急に哲学者になった？" },
    ],
  },

  {
    keyword: "ドーナッツ",
    dialogue: [
      { speaker: "まりん", text: "また【ドーナッツ】食べてる" },
      { speaker: "はじめ", text: "糖分は必要だから。仕方ないから" },
    ],
  },

  {
    keyword: "学級委員長",
    dialogue: [
      { speaker: "まりん", text: "【学級委員長】にも休息は必要でしょ" },
      { speaker: "はじめ", text: "どこかのギャルが騒がしいから……" },
    ],
  },

  {
    keyword: "コーヒー",
    dialogue: [
      { speaker: "まりん", text: "ホントに好きだよね、【コーヒー】" },
      { speaker: "はじめ", text: "この苦みが私を高めてくれる……" },
    ],
  },

  {
    keyword: "眼鏡",
    dialogue: [
      { speaker: "はじめ", text: "【眼鏡】にゴミが……" },
      { speaker: "まりん", text: "コンタクトにしないの？" },
    ],
  },

  {
    keyword: "北斗の拳",
    dialogue: [
      { speaker: "はじめ", text: "なに読んでるの？" },
      { speaker: "まりん", text: "【北斗の拳】。ゆーあーしょっく" },
    ],
  },

  {
    keyword: "ラムネ",
    dialogue: [
      { speaker: "はじめ", text: "糖分が足りなくなってきた……" },
      { speaker: "まりん", text: "【ラムネ】食べる？" },
    ],
  },

  {
    keyword: "幼なじみ",
    dialogue: [
      { speaker: "はじめ", text: "まりん、ちょっと黙って" },
      { speaker: "まりん", text: "【幼なじみ】に冷たくない……？" },
    ],
  },

  {
    keyword: "秘孔",
    dialogue: [
      { speaker: "はじめ", text: "肩こってきた……" },
      { speaker: "まりん", text: "【秘孔】、突いてあげようか？" },
    ],
  },

  {
    keyword: "スリランカの首都",
    dialogue: [
      { speaker: "はじめ", text: "【スリランカの首都】ってなんだっけ" },
      { speaker: "まりん", text: "待って、今スマホで調べる" },
    ],
  },
];

/* 作業再開した時専用のセリフ一覧 */
const resumeMessages = [
  [
    { speaker: "まりん", text: "じゃ、再開しますか" },
    { speaker: "はじめ", text: "もうひと頑張りっと……" },
  ],

  [
    { speaker: "まりん", text: "おっ、やる気あるね" },
    { speaker: "はじめ", text: "うん、ちゃんと休憩できた" },
  ],

  [
    { speaker: "はじめ", text: "まりん、休憩終わり" },
    { speaker: "まりん", text: "ほいほ～い！" },
  ],

  [
    { speaker: "はじめ", text: "タイマー再スタートね" },
    { speaker: "まりん", text: "保ってくれ、私の集中力！" },
  ],
];

/* キーワードの別名リスト
                                                          入力欄にこれらの語が入ると、対応する本来のキーワードに変換される */
const keywordMap = {
  コーヒー: ["コーヒー", "こーひー", "珈琲"],
  宿題: ["宿題", "しゅくだい"],
  勉強: ["勉強", "べんきょう"],
  高校受験: ["高校受験", "こうこうじゅけん"],
  期末試験: ["期末試験", "きまつしけん", "期末テスト", "きまつてすと"],
  全国模試: ["全国模試", "ぜんこくもし"],
  色々: ["色々", "いろいろ"],
  獣医: [
    "獣医",
    "じゅうい",
    "獣医師",
    "じゅういし",
    "獣医学",
    "じゅういがく",
    "獣医学部",
    "じゅういがくぶ",
  ],
  古生物学者: [
    "古生物学者",
    "こせいぶつがくしゃ",
    "古生物学",
    "こせいぶつがく",
    "古生物学部",
    "こせいぶつがくぶ",
  ],
  化石: ["化石", "かせき"],
  ハーバード大学: [
    "ハーバード大学",
    "はーばーどだいがく",
    "ハーバード",
    "はーばーど",
  ],
  さくらんぼ餅: [
    "さくらんぼ餅",
    "さくらんぼもち",
    "サクランボ餅",
    "サクランボもち",
  ],
  駄菓子屋さん: ["駄菓子屋さん", "だがしやさん", "駄菓子屋", "だがしや"],
  恒温動物: ["恒温動物", "こうおんどうぶつ"],
  ねじまき鳥商店: [
    "ねじまき鳥商店",
    "ネジまきどり商店",
    "ねじまきどり商店",
    "ねじまきどりしょうてん",
    "ねじまき鳥",
    "ネジまきどり",
    "ねじまきどり",
  ],
  まりん: ["まりん"],
  はじめ: ["はじめ"],
  一: ["一"],
  万里杏音: ["万里杏音", "まりあんぬ"],
  献花: ["献花", "けんか"],
  竜胆: ["竜胆", "りんどう", "竜胆一", "りんどうはじめ"],
  織田: ["織田", "おだ", "織田信長", "おだのぶなが", "信長", "のぶなが"],
  織田万里杏音: [
    "織田万里杏音",
    "おだまりあんぬ",
    "織田まりあんぬ",
    "おだ万里杏音",
  ],
  北斗の拳: ["北斗の拳", "北斗のけん", "ほくとの拳", "ほくとのけん"],
  お前はもう死んでいる: [
    "お前はもう死んでいる",
    "お前はもうしんでいる",
    "おまえはもう死んでいる",
    "おまえはもうしんでいる",
    "まりんはもう死んでいる",
    "まりんはもうしんでいる",
    "織田万里杏音はもう死んでいる",
    "織田万里杏音はもうしんでいる",
    "おだまりあんぬはもう死んでいる",
    "おだまりあんぬはもうしんでいる",
    "万里杏音はもう死んでいる",
    "万里杏音はもうしんでいる",
    "まりあんぬはもう死んでいる",
    "まりあんぬはもうしんでいる",
  ],
  また会う日まで: [
    "また会う日まで",
    "また会うひまで",
    "またあう日まで",
    "またあうひまで",
    "また逢う日まで",
    "また逢うひまで",
    "またあうひまで",
  ],
  お別れは笑顔で: [
    "お別れは笑顔で",
    "おわかれは笑顔で",
    "お別れはえがおで",
    "おわかれはえがおで",
  ],
  始まりの物語: [
    "始まりの物語",
    "始まりのものがたり",
    "はじまりの物語",
    "はじまりのものがたり",
  ],
  幼なじみ: ["幼なじみ", "おさななじみ"],
  ドーナッツ: ["ドーナッツ", "どーなっつ", "ドーナツ", "どーなつ"],
  学級委員長: [
    "学級委員長",
    "がっきゅういいんちょう",
    "委員長",
    "いいんちょう",
  ],
  秘孔: ["秘孔", "ひこう"],
  眼鏡: ["眼鏡", "めがね"],
  スリジャヤワルダナプラコッテ: [
    "スリジャヤワルダナプラコッテ",
    "すりじゃやわるだなぷらこって",
    "スリ・ジャヤワルダナプラ・コッテ",
    "すり・じゃやわるだなぷら・こって",
  ],

  ラムネ: ["ラムネ", "らむね", "ラムネ菓子", "ラムネがし", "らむね菓子"],
};

const quizKeywords = [
  "はじめの夢",
  "まりんの夢",
  "古生物学の最高学府",
  "ナントカ商店",
  "誰",
  "はじめの名前",
  "私の名前",
  "はじめの名字の花",
  "私の名字",
  "私の好きな漫画っぽく言ってよ",
  "スリランカの首都",
];

const quizAnswerMap = {
  はじめの夢: "獣医",
  まりんの夢: "古生物学者",
  古生物学の最高学府: "ハーバード大学",
  ナントカ商店: "ねじまき鳥商店",
  誰: "織田万里杏音",
  はじめの名前: "一",
  私の名前: "万里杏音",
  はじめの名字の花: "竜胆",
  私の名字: "織田",
  私の好きな漫画っぽく言ってよ: "お前はもう死んでいる",
  スリランカの首都: "スリジャヤワルダナプラコッテ",
};

/* キーワード対応セリフ一覧 */
const keywordDialogues = {
  コーヒー: {
    dialogue: [
      [
        { speaker: "まりん", text: "はじめはコーヒー苦手だもんね" },
        { speaker: "はじめ", text: "さ、砂糖入れたらいけるし……" },
      ],
      [
        { speaker: "まりん", text: "じゃあ、私のひとくち飲む？" },
        { speaker: "はじめ", text: "…………（苦々しい顔）" },
      ],
    ],
    keywordsByPage: [[], []],
  },

  宿題: {
    dialogue: [
      { speaker: "まりん", text: "やば。宿題やるの忘れてた" },
      { speaker: "はじめ", text: "今やりなよ、今……" },
    ],
    keywordsByPage: [[]],
  },

  勉強: {
    dialogue: [
      [
        { speaker: "まりん", text: "最近、勉強頑張ってるよね" },
        { speaker: "はじめ", text: "うーん……まあね" },
      ],
      [
        {
          speaker: "まりん",
          text: "こんなの【高校受験】以来じゃない？",
        },
        { speaker: "まりん", text: "【期末試験】は、まだ先でしょ？" },
      ],
    ],
    keywordsByPage: [[], ["高校受験", "期末試験"]],
  },

  高校受験: {
    dialogue: [
      [
        {
          speaker: "まりん",
          text: "私と同じ高校入るのに頑張ったもんね",
        },
        { speaker: "はじめ", text: "う、うるさいなぁ……" },
      ],
      [
        { speaker: "はじめ", text: "まりんの偏差値が高すぎるせいで……" },
        { speaker: "はじめ", text: "ホントあの時、苦労したんだから" },
      ],
      [
        { speaker: "まりん", text: "そんなに私といっしょがよかった？" },
        { speaker: "はじめ", text: "あー、もう。勉強に戻るよ！" },
      ],
    ],
    keywordsByPage: [[], [], []],
  },

  期末試験: {
    dialogue: [
      [
        { speaker: "はじめ", text: "週末に【全国模試】があるからさ" },
        { speaker: "まりん", text: "模試？　やけに力を入れてるじゃん" },
      ],
      [
        { speaker: "はじめ", text: "うちらだって、もう高２だよ" },
        { speaker: "はじめ", text: "そろそろ将来を考える時期でしょ" },
      ],
      [
        { speaker: "まりん", text: "はじめ、立派になったな" },
        { speaker: "はじめ", text: "誰視点のコメント？" },
      ],
    ],
    keywordsByPage: [["全国模試"], [], []],
  },

  全国模試: {
    dialogue: [
      [
        {
          speaker: "まりん",
          text: "じゃあ、いい大学狙うことにしたんだ",
        },
        { speaker: "はじめ", text: "まあね……" },
      ],
      [
        {
          speaker: "まりん",
          text: "大学は高望みしないって言ってたのに",
        },
        { speaker: "まりん", text: "それって、どういう心境の変化？" },
      ],
      [
        {
          speaker: "はじめ",
          text: "【色々】あって、私にも夢できたから",
        },
        { speaker: "まりん", text: "【はじめの夢】？　教えて教えて！" },
      ],
    ],
    keywordsByPage: [[], [], ["色々", "はじめの夢"]],
  },

  色々: {
    dialogue: [
      [
        { speaker: "はじめ", text: "怪我した動物を引き取ったの" },
        {
          speaker: "はじめ",
          text: "で、自分でも治してあげられたらって",
        },
      ],
      [
        { speaker: "まりん", text: "やさしーっ！　控えめに言って神！" },
        { speaker: "はじめ", text: "どこどこ？　見たい見たい！" },
      ],
      [
        { speaker: "はじめ", text: "…………そのうちにね" },
        { speaker: "まりん", text: "っしゃー！　吸いまくるぞー！" },
      ],
    ],
    keywordsByPage: [[], [], []],
  },

  獣医: {
    dialogue: [
      [
        { speaker: "まりん", text: "動物のお医者さん、ステキじゃん！" },
        { speaker: "はじめ", text: "でもヤバいよ、獣医学部は……" },
      ],
      [
        {
          speaker: "まりん",
          text: "まあ、医学部よりは簡単なはずだから",
        },
        { speaker: "はじめ", text: "私にとっては同じだって！" },
      ],
      [
        { speaker: "はじめ", text: "まあ、【まりんの夢】に比べたら" },
        { speaker: "はじめ", text: "現実的な夢ではあるけど……" },
      ],
    ],
    keywordsByPage: [[], [], ["まりんの夢"]],
  },

  古生物学者: {
    dialogue: [
      [
        {
          speaker: "はじめ",
          text: "【化石】を掘りに留学するんだよね？",
        },
        { speaker: "まりん", text: "そのために生きてますから" },
      ],
      [
        { speaker: "はじめ", text: "去年の夏なんて、びっくりだよ" },
        { speaker: "はじめ", text: "ずっとカナダに行ってたでしょ？" },
      ],
      [
        { speaker: "まりん", text: "私の論文を読んでくれた偉い人が" },
        { speaker: "まりん", text: "発掘調査の見学をさせてくれてさー" },
      ],
      [
        { speaker: "はじめ", text: "行動力ありすぎ" },
        {
          speaker: "まりん",
          text: "狙うは【古生物学の最高学府】だぜ！",
        },
      ],
    ],
    keywordsByPage: [["化石"], [], [], ["古生物学の最高学府"]],
  },

  化石: {
    dialogue: [
      [
        { speaker: "はじめ", text: "あのときは驚いたよね" },
        { speaker: "はじめ", text: "まりんが恐竜の頭蓋骨を発見したの" },
      ],
      [
        { speaker: "まりん", text: "野外学習で、はぐれちゃったときね" },
        { speaker: "まりん", text: "あれで完全にハマっちゃったな" },
      ],
      [
        { speaker: "まりん", text: "あぁ、化石……。" },
        { speaker: "まりん", text: "どうして、そんなに美しいの？" },
      ],
      [
        { speaker: "まりん", text: "時を超えたロマン、ラララ～♪" },
        { speaker: "はじめ", text: "ミュージカル始まっちゃったよ" },
      ],
    ],
    keywordsByPage: [[], [], [], []],
  },

  ハーバード大学: {
    dialogue: [
      [
        { speaker: "まりん", text: "ハバ大、いいよね……" },
        { speaker: "はじめ", text: "そんな略し方、初めて聞いた" },
      ],
      [
        { speaker: "はじめ", text: "………………" },
        { speaker: "まりん", text: "どうしたの？　悲しげな顔して" },
      ],
      [
        { speaker: "まりん", text: "わかった。さびしいんでしょ？" },
        { speaker: "まりん", text: "私と離ればなれになっちゃうから" },
      ],
      [
        { speaker: "はじめ", text: "ち、違うって……！" },
        { speaker: "まりん", text: "私の前では強がらなくてよろしい" },
      ],
      [
        { speaker: "まりん", text: "そんなはじめに、はいこれ" },
        { speaker: "まりん", text: "【さくらんぼ餅】で元気出して♪" },
      ],
    ],
    keywordsByPage: [[], [], [], [], ["さくらんぼ餅"]],
  },

  さくらんぼ餅: {
    dialogue: [
      [
        { speaker: "はじめ", text: "それ……！" },
        { speaker: "まりん", text: "え、どしたの？" },
      ],
      [
        { speaker: "はじめ", text: "あ、いや……その……" },
        { speaker: "はじめ", text: "遠足のおやつによく買ったなって……" },
      ],
      [
        { speaker: "まりん", text: "そうそう。【駄菓子屋さん】でね" },
        { speaker: "まりん", text: "……あ、そうだ" },
      ],
      [
        { speaker: "まりん", text: "あ～んしてあげようか？" },
        { speaker: "はじめ", text: "いや、自分で食べるけど……" },
      ],
    ],
    keywordsByPage: [[], [], ["駄菓子屋さん"], []],
  },

  駄菓子屋さん: {
    dialogue: [
      [
        { speaker: "まりん", text: "そういえば、あの駄菓子屋さん……" },
        { speaker: "まりん", text: "【ナントカ商店】……だよね？" },
      ],
      [
        { speaker: "まりん", text: "まだ、ちゃんとやってるんだっけ？" },
        { speaker: "まりん", text: "なんか、店名が上手く思い出せない" },
      ],
      [
        { speaker: "はじめ", text: "ムリに思い出さなくてもよくない？" },
        { speaker: "まりん", text: "いや、はじめが教えてよ" },
      ],
      [
        {
          speaker: "はじめ",
          text: "まりんが苦しんでるの、ここで見てる",
        },
        { speaker: "まりん", text: "鬼畜眼鏡！　糖分中毒！" },
      ],
      [
        { speaker: "まりん", text: "たぶん【恒温動物】なんだけどな" },
        { speaker: "はじめ", text: "範囲、広くない？" },
      ],
    ],
    keywordsByPage: [["ナントカ商店"], [], [], [], ["恒温動物"]],
  },

  恒温動物: {
    dialogue: [
      [
        { speaker: "まりん", text: "恒温動物だったような……" },
        { speaker: "はじめ", text: "うんうん" },
      ],
      [
        { speaker: "まりん", text: "ドラクエに出てきて……" },
        { speaker: "はじめ", text: "はいはい" },
      ],
      [
        { speaker: "まりん", text: "村上春樹の小説にも出てた……" },
        { speaker: "はじめ", text: "ほうほう" },
      ],
      [
        { speaker: "はじめ", text: "それで逆によく思い出せないね" },
        { speaker: "まりん", text: "喉元まで出かかってるのにー！" },
      ],
    ],
    keywordsByPage: [[], [], [], []],
  },

  ねじまき鳥商店: {
    dialogue: [
      [
        { speaker: "まりん", text: "……思い出した！" },
        { speaker: "まりん", text: "ねじまき鳥商店だよっ！" },
      ],
      [
        { speaker: "まりん", text: "それで……そうそう……" },
        { speaker: "まりん", text: "お店の角に【献花】があってさ" },
      ],
      [
        { speaker: "まりん", text: "交通事故……なのかな？" },
        { speaker: "はじめ", text: "まりん、それは……" },
      ],
      [
        { speaker: "まりん", text: "【誰】が亡くなっちゃったんだろ……" },
        { speaker: "はじめ", text: "……………………" },
      ],
      [
        { speaker: "まりん", text: "お願い、はじめ" },
        { speaker: "まりん", text: "ちゃんとフルネームで答えて" },
      ],
    ],
    keywordsByPage: [[], ["献花"], [], ["誰"], []],
  },

  まりん: {
    dialogue: [
      [
        { speaker: "まりん", text: "ん？　呼んだ？" },
        { speaker: "はじめ", text: "呼んだだけ" },
      ],
      [
        { speaker: "まりん", text: "えー、なにそれ？" },
        { speaker: "まりん", text: "ホントに呼んだだけ？" },
      ],
      [
        { speaker: "はじめ", text: "呼びたかっただけじゃダメなの？" },
        { speaker: "まりん", text: "なにそれメロい" },
      ],
    ],
    keywordsByPage: [[], [], []],
  },

  はじめ: {
    dialogue: [
      [
        { speaker: "まりん", text: "【はじめの名前】、書きやすすぎる" },
        { speaker: "はじめ", text: "画数１しかないからね" },
      ],
      [
        { speaker: "まりん", text: "色紙にサインするのも楽そうだね" },
        { speaker: "はじめ", text: "私、有名人になるの？" },
      ],
    ],
    keywordsByPage: [["はじめの名前"], []],
  },

  一: {
    dialogue: [
      [
        { speaker: "まりん", text: "それに比べて【私の名前】の長さ！" },
        { speaker: "まりん", text: "テストのとき、毎回大変すぎる" },
      ],
      [
        { speaker: "まりん", text: "万里か杏音のどっちかでいいもん" },
        { speaker: "はじめ", text: "私はカワイイと思うけどな" },
      ],
    ],
    keywordsByPage: [["私の名前"], []],
  },

  万里杏音: {
    dialogue: [
      [
        { speaker: "まりん", text: "すっごく嬉しかったんだよ" },
        {
          speaker: "まりん",
          text: "はじめが、あだ名をつけてくれたとき",
        },
      ],
      [
        {
          speaker: "はじめ",
          text: "思えば、私たちが仲良くなったのって",
        },
        { speaker: "はじめ", text: "まりんにあだ名をつけてからだよね" },
      ],
      [
        { speaker: "まりん", text: "いやまー、実は逆なんだよね" },
        { speaker: "はじめ", text: "逆って……？" },
      ],
      [
        { speaker: "まりん", text: "はじめと友達になりたかったから" },
        { speaker: "まりん", text: "あだ名つけてって言ったんだよね" },
      ],
      [
        { speaker: "はじめ", text: "え、そうだったの！？" },
        { speaker: "まりん", text: "そうなんだよね……あはは" },
      ],
    ],
    keywordsByPage: [[], [], [], [], []],
  },

  献花: {
    dialogue: [
      [
        {
          speaker: "まりん",
          text: "【はじめの名字の花】も置かれてたな",
        },
        {
          speaker: "まりん",
          text: "花言葉は、悲しみに寄り添うだっけ？",
        },
      ],
      [
        { speaker: "はじめ", text: "うん……" },
        { speaker: "まりん", text: "キレイな花だよね。私は好き" },
      ],
    ],
    keywordsByPage: [["はじめの名字の花"], []],
  },

  竜胆: {
    dialogue: [
      [
        {
          speaker: "まりん",
          text: "【私の名字】も、お花ならよかったな",
        },
        { speaker: "はじめ", text: "だって、完全に第六天魔王じゃん" },
      ],
      [
        { speaker: "はじめ", text: "ちょっ……なに言ってんの？" },
        { speaker: "まりん", text: "いや、だってホントにそうじゃん" },
      ],
      [
        { speaker: "はじめ", text: "かっこいいと思うよ。よっ、天下人" },
        { speaker: "まりん", text: "ふふふ。くるしゅうない……" },
      ],
      [
        { speaker: "まりん", text: "まあ、子孫とかじゃないらしいけど" },
        { speaker: "はじめ", text: "あ、そうなんだ" },
      ],
    ],
    keywordsByPage: [["私の名字"], [], [], []],
  },

  織田: {
    dialogue: [
      [
        { speaker: "まりん", text: "色々と言われたもんだよ" },
        { speaker: "まりん", text: "比叡山、焼き討ちするなとか" },
      ],
      [
        { speaker: "まりん", text: "何回も裏切られてやんのとか" },
        { speaker: "はじめ", text: "からかい方が歴史的すぎる" },
      ],
      [
        { speaker: "まりん", text: "おかげで信ちゃんに詳しくなったよ" },
        { speaker: "はじめ", text: "いや、馴れ馴れしい呼び方" },
      ],
    ],
    keywordsByPage: [[], [], []],
  },

  織田万里杏音: {
    dialogue: [
      [
        { speaker: "はじめ", text: "まりんは……" },
        { speaker: "はじめ", text: "織田万里杏音は、お店の角で……" },
      ],
      [
        { speaker: "はじめ", text: "………………" },
        { speaker: "まりん", text: "ねえ、はじめ" },
      ],
      [
        { speaker: "まりん", text: "【私の好きな漫画っぽく言ってよ】" },
        { speaker: "はじめ", text: "え、なにそれ……！？" },
      ],
      [
        { speaker: "まりん", text: "１回、言われてみたかったんだよね" },
        { speaker: "まりん", text: "今がベストのタイミングじゃん" },
      ],
      [
        { speaker: "はじめ", text: "ふ、ふざけないでよ！" },
        { speaker: "まりん", text: "ないない。ふざけてない" },
      ],
      [
        { speaker: "まりん", text: "だって、湿っぽいのイヤじゃん" },
        { speaker: "はじめ", text: "まりん……。わかったよ" },
      ],
    ],
    keywordsByPage: [[], [], ["私の好きな漫画っぽく言ってよ"], [], [], []],
  },

  北斗の拳: {
    dialogue: [
      { speaker: "はじめ", text: "前から好きだよね。何きっかけ？" },
      { speaker: "まりん", text: "パパ。電子書籍でも買っちゃった" },
    ],
    keywordsByPage: [[]],
  },

  お前はもう死んでいる: {
    dialogue: [
      [
        { speaker: "まりん", text: "うん、やっぱりそうなんだね" },
        { speaker: "はじめ", text: "納得してくれた？" },
      ],
      [
        { speaker: "はじめ", text: "あの日、私から誘ったんだよ" },
        { speaker: "はじめ", text: "久しぶりに駄菓子屋に行こうって……" },
      ],
      [
        {
          speaker: "はじめ",
          text: "そうしたら、道路のちょうど真ん中に",
        },
        { speaker: "はじめ", text: "怪我した子猫がうずくまってて……" },
      ],
      [
        { speaker: "まりん", text: "私は子猫を助けて、死んじゃったと" },
        { speaker: "はじめ", text: "うん、私に子猫を預けて……" },
      ],
      [
        {
          speaker: "まりん",
          text: "化石を掘る前に、自分が骨になるとは",
        },
        { speaker: "はじめ", text: "バカ！　バカ幽霊！" },
      ],
      [
        { speaker: "はじめ", text: "私が駄菓子屋に誘ったから……" },
        { speaker: "はじめ", text: "まりんは……まりんは……" },
      ],
      [
        { speaker: "まりん", text: "はじめが友達でよかったって" },
        { speaker: "まりん", text: "私は心の底から、そう思ってるよ" },
      ],
      [
        { speaker: "はじめ", text: "私だって……そう思ってる" },
        { speaker: "まりん", text: "だったら、笑顔でお別れしようよ" },
      ],
      [
        { speaker: "はじめ", text: "……………………" },
        { speaker: "はじめ", text: "そうか……そうだよね……" },
      ],
      [
        { speaker: "はじめ", text: "もう死んでるって、言えなかった" },
        { speaker: "はじめ", text: "毎日、自分をごまかしてた" },
      ],
      [
        { speaker: "はじめ", text: "でも、ちゃんとお別れできないと" },
        { speaker: "はじめ", text: "まりんも次に進めないよね" },
      ],
      [
        { speaker: "まりん", text: "はじめ……！" },
        { speaker: "はじめ", text: "わかった。笑顔でお別れしよう" },
      ],
      [
        { speaker: "まりん", text: "ありがとう" },
        { speaker: "はじめ", text: "うん……" },
      ],
      [
        { speaker: "まりん", text: "じゃあね、はじめ" },
        { speaker: "まりん", text: "【また会う日まで】" },
      ],
    ],
    keywordsByPage: [
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      ["また会う日まで"],
    ],
  },

  幼なじみ: {
    dialogue: [
      [
        { speaker: "はじめ", text: "腐れ縁の間違いじゃない？" },
        { speaker: "まりん", text: "私たち幼稚園からいっしょじゃん！" },
      ],
      [
        { speaker: "まりん", text: "ちゅーの練習した仲でしょ！？" },
        { speaker: "はじめ", text: "……ちょっ！？" },
      ],
      [
        { speaker: "はじめ", text: "そんなの５歳ぐらいの話じゃん！" },
        { speaker: "はじめ", text: "忘れて！　早く忘れて！" },
      ],
      [
        { speaker: "まりん", text: "いーや、死ぬまで忘れないね" },
        { speaker: "まりん", text: "老人ホームでも話すね" },
      ],
    ],
    keywordsByPage: [[], [], [], []],
  },

  ドーナッツ: {
    dialogue: [
      { speaker: "はじめ", text: "まりんもひとつ食べる？" },
      { speaker: "まりん", text: "最近おなか空かないんだよね" },
    ],
    keywordsByPage: [[]],
  },

  学級委員長: {
    dialogue: [
      { speaker: "はじめ", text: "まあ、内申点稼ぎだけどね" },
      { speaker: "まりん", text: "よくやるよー。私には絶対ムリ！" },
    ],
    keywordsByPage: [[]],
  },

  秘孔: {
    dialogue: [
      [
        { speaker: "はじめ", text: "やだ。絶対、全身バラバラになる" },
        { speaker: "まりん", text: "へーきへーき。私、天才だから" },
      ],
      [
        { speaker: "はじめ", text: "そういうやつが一番ヤバい！" },
        { speaker: "まりん", text: "ふふふ、痛いのは一瞬だから……" },
      ],
    ],
    keywordsByPage: [[], []],
  },

  眼鏡: {
    dialogue: [
      [
        { speaker: "はじめ", text: "私は永遠の眼鏡派だからね" },
        { speaker: "まりん", text: "本当はコンタクトが怖いんでしょ？" },
      ],
      [
        { speaker: "はじめ", text: "こ、怖くないし！　それに……" },
        {
          speaker: "はじめ",
          text: "まりんが似合うって言ってくれたから",
        },
      ],
      [
        { speaker: "まりん", text: "ほほーう、流石は私" },
        {
          speaker: "まりん",
          text: "人の自己肯定感を上げるのが上手い！",
        },
      ],
    ],
    keywordsByPage: [[], [], []],
  },

  スリジャヤワルダナプラコッテ: {
    dialogue: [
      { speaker: "まりん", text: "思い出せてスッキリした？" },
      { speaker: "はじめ", text: "うん、これで勉強に集中できる" },
    ],
    keywordsByPage: [[]],
  },

  ラムネ: {
    dialogue: [
      { speaker: "はじめ", text: "ブドウ糖が疲れた脳に効く……" },
      { speaker: "まりん", text: "キマってんねえ" },
    ],
    keywordsByPage: [[]],
  },
};

const endingDialogue = [
  { speaker: "　", text: "クリアおめでとうございます" },
  { speaker: "　", text: "最後のキーワード【お別れは笑顔で】" },
];

const keywordListItems = [
  ...[...new Set(breakMessages.map((item) => item.keyword))].map((keyword) => ({
    type: "normal",
    keyword: keyword,
  })),

  ...Object.keys(keywordDialogues)
    .filter((keyword) => !Object.values(quizAnswerMap).includes(keyword))
    .map((keyword) => ({
      type: "normal",
      keyword: keyword,
    })),

  ...Object.entries(quizAnswerMap).map(([question, answer]) => ({
    type: "quiz",
    question: question,
    answer: answer,
  })),
];
